<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title></title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="author" content="Alexander Bulimov">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
      <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le styles -->
<link href='/assets/stylesheets/bootstrap.min-88238289010db19359d2181e634e95cd.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/style-e81fa375b231bedf6cb2dbc6653570cc.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/google_prettify/sons-of-obsidian-afb0925bfa2d994f17dab93e13fbf999.css' type='text/css' rel='stylesheet' media='all'>
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->
  </head>

  <body>

    <div class="navbar">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Alexander Bulimov&#39;s blog</a>
          <ul class="nav">
              
                <li><a href="/archive">Статьи</a></li>
              
              
                <li><a href="/tags">Теги</a></li>
              
              
                <li><a href="/categories">Категории</a></li>
              
              
                <li><a href="/about">Обо мне</a></li>
              
          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        <div class="row-fluid">
  <div class="span12">
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9F%D0%BE%D0%B1%D1%8B%D0%B2%D0%B0%D0%BB-%D0%BD%D0%B0-devops-meetup-25-%D1%8F%D0%BD%D0%B2%D0%B0%D1%80%D1%8F">Побывал на DevOps Meetup 25 января</a> <span class="date">2014-01-27</span></h3>

        <div class="summary">
<p>&#1048;&#1079; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076;&#1086;&#1074; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076; &#1087;&#1088;&#1086; Docker, &#1088;&#1072;&#1076;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;
&#1103; &#1080; &#1093;&#1086;&#1076;&#1080;&#1083; &#1085;&#1072; &#1101;&#1090;&#1086;&#1090; Meetup, &#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1083;&#1086;&#1093;&#1080;&#1084;.
&#1042;&#1099;&#1096;&#1077;&#1083; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1084;&#1072;&#1083;&#1100;&#1095;&#1080;&#1082; &#1080;&#1079; &#1071;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072;, &#1078;&#1091;&#1090;&#1082;&#1086; &#1079;&#1072;&#1091;&#1085;&#1099;&#1074;&#1085;&#1086;
&#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083; &#1073;&#1072;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086; Docker, &#1085;&#1072; &#1074;&#1089;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1077;
&#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1083; "&#1103; &#1085;&#1077; &#1079;&#1085;&#1072;&#1102;".</p>

<p>&#1047;&#1072;&#1090;&#1086; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076;&#1099; &#1073;&#1099;&#1083;&#1080; &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;.
&#1051;&#1080;&#1095;&#1085;&#1086; &#1084;&#1077;&#1085;&#1103; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1088;&#1072;&#1076;&#1086;&#1074;&#1072;&#1083; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076; &#1048;&#1074;&#1072;&#1085;&#1072; &#1045;&#1074;&#1090;&#1091;&#1093;&#1086;&#1074;&#1080;&#1095;&#1072;
&#1087;&#1088;&#1086; librarian &#1080; Berkshelf. &#1055;&#1086;&#1088;&#1072;&#1076;&#1086;&#1074;&#1072;&#1083; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1048;&#1074;&#1072;&#1085; &#1074;&#1099;&#1088;&#1072;&#1079;&#1080;&#1083;
&#1084;&#1086;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1087;&#1086; &#1087;&#1086;&#1074;&#1086;&#1076;&#1091; community-&#1082;&#1091;&#1082;&#1073;&#1091;&#1082;&#1086;&#1074;.</p>

<p>&#1042;&#1103;&#1095;&#1077;&#1089;&#1083;&#1072;&#1074; &#1050;&#1091;&#1079;&#1085;&#1077;&#1094;&#1086;&#1074; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1081; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076; &#1086; &#1090;&#1086;&#1084;, &#1082; &#1082;&#1072;&#1082;&#1086;&#1081;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; Chef &#1086;&#1085;&#1080; &#1087;&#1088;&#1080;&#1096;&#1083;&#1080;.</p>

<p>&#1053;&#1091; &#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1093;&#1086;&#1095;&#1091; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076; &#1040;&#1085;&#1076;&#1088;&#1077;&#1103; &#1057;&#1084;&#1080;&#1088;&#1085;&#1086;&#1074;&#1072; &#1087;&#1088;&#1086;
<a href="http://www.aptly.info/">aply</a>. &#1069;&#1090;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;&#1084;&#1080; Debian,
&#1095;&#1090;&#1086;-&#1090;&#1086; &#1074;&#1088;&#1086;&#1076;&#1077; reprepro &#1089; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1083;&#1080;&#1094;&#1086;&#1084;. &#1057;&#1077;&#1081;&#1095;&#1072;&#1089;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1089;&#1077; &#1089;&#1099;&#1088;&#1086;,
&#1085;&#1086; &#1080;&#1076;&#1077;&#1103; &#1079;&#1076;&#1088;&#1072;&#1074;&#1072;&#1103;, &#1080; &#1087;&#1080;&#1096;&#1077;&#1090; &#1101;&#1090;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1040;&#1085;&#1076;&#1088;&#1077;&#1081; &#1085;&#1072; &#1095;&#1080;&#1089;&#1090;&#1086;&#1084; &#1101;&#1085;&#1090;&#1091;&#1079;&#1080;&#1072;&#1079;&#1084;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100;
&#1080; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1074;&#1072;&#1083;&#1100;&#1085;&#1086;.</p>

<p><a href="http://tech.yandex.ru/events/yagosti/devops/">&#1058;&#1091;&#1090;</a>, &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;, &#1074;&#1099;&#1083;&#1086;&#1078;&#1072;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1076;&#1086;&#1082;&#1083;&#1072;&#1076;&#1086;&#1074;.</p>
</div>

        <div class="more">
          <a href="/it/%D0%9F%D0%BE%D0%B1%D1%8B%D0%B2%D0%B0%D0%BB-%D0%BD%D0%B0-devops-meetup-25-%D1%8F%D0%BD%D0%B2%D0%B0%D1%80%D1%8F" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%A0%D0%B0%D1%81%D1%88%D0%B8%D1%80%D1%8F%D0%B5%D0%BC-%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%D1%81%D1%82%D0%B8-nginx-%D1%81-%D0%BF%D0%BE%D0%BC%D0%BE%D1%89%D1%8C%D1%8E-lua">Расширяем возможности Nginx с помощью Lua</a> <span class="date">2013-11-08</span></h3>

        <div class="summary ellipsis">
<p>&#1042;&#1089;&#1090;&#1072;&#1083;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1085;&#1072;&#1079;&#1072;&#1076; &#1087;&#1077;&#1088;&#1077;&#1076;&#1086; &#1084;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; -
&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086; &#1087;&#1086;&#1083;&#1102; Serial &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1089;&#1082;&#1080;&#1077; &#1089;&#1077;&#1088;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1099;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1072;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1084; &#1080;&#1079; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1086;&#1074;.
&#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1085;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100; &#1089;&#1077;&#1088;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;, &#1085;&#1086; &#1077;&#1097;&#1077; &#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100;
&#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1089;&#1077;&#1088;&#1080;&#1081;&#1085;&#1080;&#1082;&#1072; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1085;&#1099;&#1093;, &#1085;&#1072; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1091;&#1090;&#1077;&#1095;&#1082;&#1080; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1089;&#1082;&#1086;&#1075;&#1086;
&#1089;&#1077;&#1088;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1072;. &#1057;&#1077;&#1088;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1099; &#1074;&#1099;&#1076;&#1072;&#1077;&#1084; &#1085;&#1077; &#1084;&#1099;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1086;&#1090;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084;,
&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1086;&#1090;&#1086;&#1079;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1090;&#1086;&#1078;&#1077; &#1085;&#1077;&#1090;.</p>

<p>&#1056;&#1077;&#1096;&#1072;&#1090;&#1100; &#1103; &#1101;&#1090;&#1091; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1089;&#1090;&#1072;&#1083; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; Nginx, &#1080; &#1087;&#1086;&#1095;&#1090;&#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1073;&#1099;&#1083;
&#1089;&#1083;&#1077;&#1087;&#1083;&#1077;&#1085; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1090;&#1091;&#1087;&#1086;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; "&#1074; &#1083;&#1086;&#1073;":</p>

<pre>
set $valid_serial 'false';
if ($ssl_client_serial ~ '01') { set $valid_serial 'true'; }
if ($ssl_client_serial ~ '02') { set $valid_serial 'true'; }
...
if ($ssl_client_serial ~ 'NN') { set $valid_serial 'true'; }
if ($valid_serial ~ false) { return 403; break; }
</pre>

<p>&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079; Ansible, &#1090;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;
&#1074;&#1099;&#1096;&#1077;&#1083; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081;, &#1080; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1077;&#1088;&#1080;&#1081;&#1085;&#1080;&#1082;&#1086;&#1074; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1085;&#1091;&#1078;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1072; &#1089; if. &#1058;&#1072;&#1082; &#1086;&#1085;&#1086; &#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1072; &#1087;&#1088;&#1080; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1074;
3-5 &#1089;&#1077;&#1088;&#1080;&#1081;&#1085;&#1080;&#1082;&#1086;&#1074;, &#1085;&#1086; &#1087;&#1088;&#1080;&#1073;&#1083;&#1080;&#1078;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1073;&#1099;&#1083; &#1074;&#1099;&#1088;&#1072;&#1089;&#1090;&#1080; &#1076;&#1086; 100+, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080; &#1076;&#1086; 1000+...</p>
</div>

        <div class="more">
          <a href="/it/%D0%A0%D0%B0%D1%81%D1%88%D0%B8%D1%80%D1%8F%D0%B5%D0%BC-%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%D1%81%D1%82%D0%B8-nginx-%D1%81-%D0%BF%D0%BE%D0%BC%D0%BE%D1%89%D1%8C%D1%8E-lua" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/auto-backup-%D0%BA%D0%BE%D0%BD%D1%84%D0%B8%D0%B3%D0%BE%D0%B2-%D0%B0%D0%BA%D1%82%D0%B8%D0%B2%D0%BA%D0%B8-%D1%87%D0%B5%D1%80%D0%B5%D0%B7-rancid">Auto-backup конфигов активки через Rancid</a> <span class="date">2013-11-01</span></h3>

        <div class="summary">
<p>&#1053;&#1072; &#1076;&#1085;&#1103;&#1093; &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1083; &#1082;&#1086;&#1083;&#1083;&#1077;&#1075;&#1077; &#1089; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1086;&#1081; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1073;&#1077;&#1082;&#1072;&#1087;&#1072;
&#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1081; &#1085;&#1072;&#1096;&#1077;&#1081; &#1072;&#1082;&#1090;&#1080;&#1074;&#1082;&#1080; (Cisco, Juniper), &#1080; &#1085;&#1072;&#1096;&#1077;&#1083;
&#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; (&#1087;&#1086;&#1093;&#1086;&#1078;&#1077;, &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077;) -
<a href="http://www.shrubbery.net/rancid/">rancid</a>.</p>

<p>&#1058;&#1086;&#1095;&#1085;&#1077;&#1077;, &#1077;&#1075;&#1086; &#1092;&#1086;&#1088;&#1082; <a href="https://github.com/dotwaffle/rancid-git">rancid-git</a>,
&#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102; &#1074;&#1077;&#1079;&#1076;&#1077; &#1080; &#1074;&#1089;&#1102;&#1076;&#1091; git, &#1080; &#1088;&#1072;&#1076;&#1080; &#1073;&#1077;&#1082;&#1072;&#1087;&#1086;&#1074; &#1075;&#1086;&#1088;&#1086;&#1076;&#1080;&#1090;&#1100; CVS &#1080;&#1083;&#1080;
Subversion &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1085;&#1077;&#1091;&#1076;&#1086;&#1073;&#1085;&#1086;.</p>

<p>&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, rancid &#1101;&#1090;&#1086;&#1090; - &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;
expect &#1080; bash-&#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1074; &#1089;&#1086;&#1086;&#1088;&#1091;&#1076;&#1080;&#1090;&#1100; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1077;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1097;&#1077;&#1077;
&#1089;&#1074;&#1086;&#1102; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1082;&#1088;&#1072;&#1090;&#1094;&#1077; - &#1086;&#1085;&#1086; &#1087;&#1086; &#1082;&#1088;&#1086;&#1085;&#1091; &#1093;&#1086;&#1076;&#1080;&#1090; &#1095;&#1077;&#1088;&#1077;&#1079; telnet/ssh &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1093;&#1086;&#1089;&#1090;&#1072;&#1084;,
&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; expect &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089; &#1085;&#1080;&#1093; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; + &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1080;, &#1072; &#1087;&#1086;&#1090;&#1086;&#1084; &#1074;&#1099;&#1074;&#1086;&#1076; &#1082;&#1083;&#1072;&#1076;&#1077;&#1090;
&#1074; CVS/subversion/git. &#1042; &#1080;&#1090;&#1086;&#1075;&#1077; - &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1087;&#1086;&#1083;&#1085;&#1091;&#1102; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1102; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;
&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1074; &#1084;&#1086;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; - &#1074; git. &#1055;&#1088;&#1080;&#1095;&#1077;&#1084; rancid-git
&#1091;&#1084;&#1077;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1084;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1082;&#1086;&#1084;&#1084;&#1080;&#1090; &#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; push.</p>

<p>&#1071; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091; &#1090;&#1091;&#1090; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1090;&#1091;&#1090;&#1086;&#1088;&#1080;&#1072;&#1083; &#1072;-&#1083;&#1103; &#1061;&#1072;&#1073;&#1088;&#1072;&#1093;&#1072;&#1073;&#1088; &#1089; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1084;&#1080; &#1090;&#1080;&#1087;&#1072; git clone &amp;&amp; make,
&#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; rancid-git &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1081; readme, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1086; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1082;&#1072;&#1082;
&#1089;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100; deb-&#1087;&#1072;&#1082;&#1077;&#1090;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1095;&#1090;&#1086; &#1080; &#1076;&#1083;&#1103; &#1095;&#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1090;&#1100;.
&#1071; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1087;&#1086;&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1102; &#1101;&#1090;&#1086;&#1090; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1074;&#1089;&#1077;&#1084;, &#1082;&#1086;&#1084;&#1091; &#1093;&#1086;&#1095;&#1077;&#1090;&#1089;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1082;&#1080; &#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;.</p>
</div>

        <div class="more">
          <a href="/it/auto-backup-%D0%BA%D0%BE%D0%BD%D1%84%D0%B8%D0%B3%D0%BE%D0%B2-%D0%B0%D0%BA%D1%82%D0%B8%D0%B2%D0%BA%D0%B8-%D1%87%D0%B5%D1%80%D0%B5%D0%B7-rancid" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%92%D0%BA%D0%BB%D1%8E%D1%87%D0%B8%D0%BB-%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B0%D1%80%D0%B8%D0%B8">Включил комментарии</a> <span class="date">2013-10-18</span></h3>

        <div class="summary"><p>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; Disqus, &#1084;&#1086;&#1078;&#1077;&#1090; &#1082;&#1090;&#1086;-&#1090;&#1086;
&#1095;&#1090;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1085;&#1072;&#1087;&#1080;&#1096;&#1077;&#1090; &#1074; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1093;.</p></div>

        <div class="more">
          <a href="/it/%D0%92%D0%BA%D0%BB%D1%8E%D1%87%D0%B8%D0%BB-%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B0%D1%80%D0%B8%D0%B8" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%A1%D0%B4%D0%B0%D0%BB-%D1%8D%D0%BA%D0%B7%D0%B0%D0%BC%D0%B5%D0%BD-%D0%BD%D0%B0-rhce">Сдал экзамен на RHCE</a> <span class="date">2013-10-14</span></h3>

        <div class="summary">
<p>&#1053;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;-&#1090;&#1086; &#1087;&#1088;&#1080;&#1096;&#1077;&#1083; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1101;&#1082;&#1079;&#1072;&#1084;&#1077;&#1085;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1076;&#1072;&#1074;&#1072;&#1083; &#1074; &#1087;&#1103;&#1090;&#1085;&#1080;&#1094;&#1091;. 273 &#1080;&#1079; 300 &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1073;&#1072;&#1083;&#1083;&#1077; &#1074; 210. &#1069;&#1090;&#1086;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;,
&#1085;&#1077;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1086; - &#1078;&#1076;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;. &#1053;&#1072; RHCSA &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1087;&#1088;&#1080;&#1096;&#1077;&#1083; &#1074; &#1090;&#1091; &#1078;&#1077; &#1087;&#1103;&#1090;&#1085;&#1080;&#1094;&#1091; &#1086;&#1082;&#1086;&#1083;&#1086; 8 &#1074;&#1077;&#1095;&#1077;&#1088;&#1072;.</p>

<p>&#1055;&#1086; &#1089;&#1072;&#1084;&#1086;&#1084;&#1091; &#1082;&#1091;&#1088;&#1089;&#1091; "&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1077; &#1040;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;" &#1080; &#1101;&#1082;&#1079;&#1072;&#1084;&#1077;&#1085;&#1091;: &#1095;&#1080;&#1090;&#1072;&#1083; &#1091; &#1084;&#1077;&#1085;&#1103; &#1074;&#1089;&#1077; &#1090;&#1088;&#1080; &#1095;&#1072;&#1089;&#1090;&#1080; &#1082;&#1091;&#1088;&#1089;&#1072; &#1048;&#1083;&#1100;&#1103; &#1057;&#1086;&#1073;&#1086;&#1083;&#1077;&#1074;.
&#1050;&#1091;&#1088;&#1089; &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1084;&#1072;&#1085; &#1080; &#1089;&#1073;&#1072;&#1083;&#1072;&#1085;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;, &#1085;&#1091; &#1080; &#1095;&#1080;&#1090;&#1072;&#1077;&#1090; &#1077;&#1075;&#1086; &#1057;&#1086;&#1073;&#1086;&#1083;&#1077;&#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086;. &#1057; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086; &#1101;&#1090;&#1080;&#1093; &#1082;&#1091;&#1088;&#1089;&#1086;&#1074; &#1091;&#1078;&#1077; 3 &#1075;&#1086;&#1076;&#1072; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1089;&#1103; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Linux-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; (&#1087;&#1088;&#1072;&#1074;&#1076;&#1072;, &#1085;&#1077; RHEL, &#1072; Debian),
&#1084;&#1086;&#1075;&#1091; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1087;&#1086;&#1076;&#1072;&#1095;&#1072; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1089;&#1084;&#1099;&#1089;&#1083;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1074;&#1077;&#1097;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1096;&#1100;&#1089;&#1103; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;,
&#1085;&#1086; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1077;&#1095;&#1085;&#1086; &#1085;&#1077;&#1082;&#1086;&#1075;&#1076;&#1072;. &#1044;&#1072; &#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1084;&#1086;&#1079;&#1075;&#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103;.</p>

<p>&#1045;&#1097;&#1077; &#1074; &#1087;&#1083;&#1102;&#1089;&#1072;&#1093; &#1084;&#1086;&#1075;&#1091; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1093;&#1074;&#1072;&#1095;&#1077;&#1085;&#1099; &#1090;&#1077;&#1084;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1088;&#1077;&#1085;&#1077;&#1073;&#1088;&#1077;&#1075;&#1072;&#1102;&#1090; &#1080;&#1079;-&#1079;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1072;&#1090;&#1088;&#1072;&#1090; &#1085;&#1072; &#1080;&#1093;
&#1086;&#1089;&#1074;&#1086;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1080;&#1087;&#1072; LVM &#1080;&#1083;&#1080; SELinux. &#1051;&#1080;&#1095;&#1085;&#1086; &#1084;&#1085;&#1077; &#1073;&#1099;&#1083;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086; &#1087;&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; RHEL-&#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1074;&#1077;&#1097;&#1072;&#1084;&#1080; &#1074;&#1088;&#1086;&#1076;&#1077; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; RPM-&#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;,
&#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; &#1089; &#1085;&#1080;&#1084;&#1080;, &#1080;&#1083;&#1080; kickstart.</p>

<p>&#1042; &#1086;&#1073;&#1097;&#1077;&#1084;, &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077;, &#1075;&#1086;&#1076;&#1085;&#1099;&#1077; &#1082;&#1091;&#1088;&#1089;&#1099; &#1087;&#1086; Linux, &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1073;&#1077;&#1079; &#1072;&#1082;&#1094;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1081; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;.
&#1048; &#1101;&#1082;&#1079;&#1072;&#1084;&#1077;&#1085;&#1099; (&#1080; RHCSA, &#1080; RHCE) &#1074;&#1077;&#1089;&#1100;&#1084;&#1072; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1089;&#1084;&#1099;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1076;&#1072;&#1085;&#1086; &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1088;&#1072;&#1089;&#1089;&#1083;&#1072;&#1073;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103;.</p>
</div>

        <div class="more">
          <a href="/it/%D0%A1%D0%B4%D0%B0%D0%BB-%D1%8D%D0%BA%D0%B7%D0%B0%D0%BC%D0%B5%D0%BD-%D0%BD%D0%B0-rhce" class="btn btn-small">read more..</a>
        </div>
      </div>
    
    <div class="pagination">
      <ul>
          <li><a href="/">1</a></li>
          <li class="active"><a href="/posts/index/2">2</a></li>
          <li><a href="/posts/index/3">3</a></li>
          <li><a href="/posts/index/4">4</a></li>
          <li><a href="/posts/index/5">5</a></li>
      </ul>
    </div>
  </div>
</div>

      </div>

      <hr>
      <div class="footer">
          <p>&copy; <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/"><img alt="Creative Commons License" style="border-width:0" src="http://i.creativecommons.org/l/by-sa/3.0/80x15.png" /></a> Alexander Bulimov
          with help from <a href="http://ruhoh.com" target="_blank" title="The Definitive Technical Blogging Framework">ruhoh</a>
          and <a href="http://twitter.github.com/bootstrap/" target="_blank">Twitter Bootstrap</a>
        </p>
      </div>

    </div> <!-- /container -->

    <!-- Google Prettify -->
<script src="http://cdnjs.cloudflare.com/ajax/libs/prettify/188.0.0/prettify.js"></script>
<script>
  var pres = document.getElementsByTagName("pre");
  for (var i=0; i < pres.length; ++i) {
    pres[i].className = "prettyprint linenums";
  }
  prettyPrint();
</script>
<!-- end Google Prettify -->
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-49230997-1']);
  _gaq.push(['_trackPageview']);
  

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>



  </body>
</html>
