<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title></title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="author" content="Alexander Bulimov">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
      <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le styles -->
<link href='/assets/stylesheets/bootstrap.min-88238289010db19359d2181e634e95cd.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/style-e81fa375b231bedf6cb2dbc6653570cc.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/google_prettify/sons-of-obsidian-afb0925bfa2d994f17dab93e13fbf999.css' type='text/css' rel='stylesheet' media='all'>
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->
  </head>

  <body>

    <div class="navbar">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Alexander Bulimov&#39;s blog</a>
          <ul class="nav">
              
                <li><a href="/archive">Статьи</a></li>
              
              
                <li><a href="/tags">Теги</a></li>
              
              
                <li><a href="/categories">Категории</a></li>
              
              
                <li><a href="/about">Обо мне</a></li>
              
          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        <div class="row-fluid">
  <div class="span12">
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9C%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BE-chef">Мнение о Chef</a> <span class="date">2013-06-17</span></h3>

        <div class="summary ellipsis">
<p>&#1071; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083; Chef &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; IT-&#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; &#1086;&#1082;&#1086;&#1083;&#1086; &#1087;&#1086;&#1083;&#1091;&#1090;&#1086;&#1088;&#1072; &#1083;&#1077;&#1090;, &#1085;&#1072;&#1095;&#1072;&#1074; &#1089;
&#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 0.10. &#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072;, &#1075;&#1076;&#1077;-&#1090;&#1086; &#1087;&#1086;&#1083;-&#1075;&#1086;&#1076;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080;,
&#1073;&#1077;&#1079; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1055;&#1054; &#1089; &#1085;&#1091;&#1083;&#1103;. &#1047;&#1072;&#1090;&#1077;&#1084;, &#1091;&#1078;&#1077; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; &#1080; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089; &#1085;&#1091;&#1083;&#1103; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; (30+ &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074;, nginx, ruby, riak, redis,
sphinx-search, rabbitmq &#1080; &#1090;.&#1087;.).
&#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1083;&#1086; &#1084;&#1085;&#1077; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1085;&#1077;&#1085;&#1080;&#1077; o &#1076;&#1086;&#1089;&#1090;&#1086;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072;&#1093; &#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1072;&#1093; Chef,
&#1080; &#1074; &#1101;&#1090;&#1086;&#1081; &#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1077; &#1103; &#1089;&#1074;&#1086;&#1077; &#1084;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079;&#1083;&#1072;&#1075;&#1072;&#1102;.</p>

<p>&#1055;&#1086; &#1080;&#1090;&#1086;&#1075;&#1091; &#1074;&#1099;&#1096;&#1077;&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1081; &#1076;&#1077;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1103; &#1073;&#1099;&#1083; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1090;&#1086;&#1084;&#1083;&#1077;&#1085;
&#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1072;&#1084;&#1080; Chef, &#1095;&#1090;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1079;&#1072;&#1084;&#1077;&#1085;&#1091;. &#1041;&#1099;&#1083; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085; Puppet &#1080; &#1085;&#1072;&#1073;&#1080;&#1088;&#1072;&#1074;&#1096;&#1080;&#1081; &#1090;&#1086;&#1075;&#1076;&#1072;
&#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100; Ansible. &#1044;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103; &#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1083; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1079; &#1090;&#1086;&#1075;&#1086;,
&#1095;&#1090;&#1086; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; Chef, &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1101;&#1090;&#1080;&#1093; &#1076;&#1074;&#1091;&#1093; SCM.
&#1055;&#1086; &#1080;&#1090;&#1086;&#1075;&#1091;, &#1073;&#1099;&#1083; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; Ansible &#1080;&#1079;-&#1079;&#1072; &#1085;&#1077;&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1081; &#1095;&#1080;&#1090;&#1072;&#1073;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1080;&#1093;&#1089;&#1103; playbook-&#1086;&#1074;,
&#1093;&#1086;&#1090;&#1103; Puppet &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086;&#1084; &#1086;&#1073;&#1086;&#1096;&#1077;&#1083; Chef. &#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1088;&#1072;&#1076;&#1086;&#1074;&#1072;&#1083;&#1072; &#1076;&#1077;&#1082;&#1083;&#1072;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100; Ansible &#1080; Puppet,
&#1072; &#1074;&#1086;&#1090; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; Puppet &#1086;&#1075;&#1086;&#1088;&#1095;&#1080;&#1083;&#1072;.</p>

<p>&#1050;&#1072;&#1082;-&#1073;&#1099; &#1090;&#1086; &#1085;&#1080; &#1073;&#1099;&#1083;&#1086;, &#1087;&#1086; &#1080;&#1090;&#1086;&#1075;&#1091; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; Chef &#1091; &#1084;&#1077;&#1085;&#1103; &#1089;&#1083;&#1086;&#1078;&#1080;&#1083;&#1086;&#1089;&#1100; &#1090;&#1072;&#1082;&#1086;&#1077; &#1084;&#1085;&#1077;&#1085;&#1080;&#1077;:</p>

<ul>
<li>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1085;&#1086;&#1081;, &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1089;&#1088;&#1077;&#1076;&#1099;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;-&#1083;&#1077;&#1090;&#1091; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1090;&#1100;
&#1089;&#1086;&#1092;&#1090; &#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; - Chef &#1080;&#1076;&#1077;&#1072;&#1083;&#1077;&#1085;. &#1058;&#1091;&#1090; &#1077;&#1075;&#1086; &#1080;&#1084;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1088;&#1072;&#1079; &#1082; &#1084;&#1077;&#1089;&#1090;&#1091;,
&#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077;, &#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1074; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;.</li>
<li>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1080;&#1084;&#1077;&#1077;&#1084; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1093;&#1086;&#1089;&#1090;&#1086;&#1074;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1093; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1089;&#1074;&#1086;&#1102; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1088;&#1086;&#1083;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072;
&#1083;&#1102;&#1073;&#1086;&#1077; &#1087;&#1077;&#1088;&#1077;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1089;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1089;&#1090;&#1086;&#1084; - Chef &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1077;&#1085;, &#1080; &#1076;&#1072;&#1078;&#1077; &#1074;&#1088;&#1077;&#1076;&#1077;&#1085;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091;
&#1087;&#1088;&#1086;&#1074;&#1086;&#1094;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1080;-&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1072; &#1085;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1080;-&#1076;&#1072;&#1085;&#1085;&#1099;&#1077;.</li>
</ul>
</div>

        <div class="more">
          <a href="/it/%D0%9C%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BE-chef" class="btn btn-small">read more..</a>
        </div>
      </div>
    
    <div class="pagination">
      <ul>
          <li><a href="/">1</a></li>
          <li><a href="/posts/index/2">2</a></li>
          <li><a href="/posts/index/3">3</a></li>
          <li><a href="/posts/index/4">4</a></li>
          <li class="active"><a href="/posts/index/5">5</a></li>
      </ul>
    </div>
  </div>
</div>

      </div>

      <hr>
      <div class="footer">
          <p>&copy; <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/"><img alt="Creative Commons License" style="border-width:0" src="http://i.creativecommons.org/l/by-sa/3.0/80x15.png" /></a> Alexander Bulimov
          with help from <a href="http://ruhoh.com" target="_blank" title="The Definitive Technical Blogging Framework">ruhoh</a>
          and <a href="http://twitter.github.com/bootstrap/" target="_blank">Twitter Bootstrap</a>
        </p>
      </div>

    </div> <!-- /container -->

    <!-- Google Prettify -->
<script src="http://cdnjs.cloudflare.com/ajax/libs/prettify/188.0.0/prettify.js"></script>
<script>
  var pres = document.getElementsByTagName("pre");
  for (var i=0; i < pres.length; ++i) {
    pres[i].className = "prettyprint linenums";
  }
  prettyPrint();
</script>
<!-- end Google Prettify -->
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-49230997-1']);
  _gaq.push(['_trackPageview']);
  

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>



  </body>
</html>
