<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title></title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="author" content="Alexander Bulimov">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
      <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le styles -->
<link href='/assets/stylesheets/bootstrap.min-88238289010db19359d2181e634e95cd.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/style-e81fa375b231bedf6cb2dbc6653570cc.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/google_prettify/sons-of-obsidian-afb0925bfa2d994f17dab93e13fbf999.css' type='text/css' rel='stylesheet' media='all'>
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->
  </head>

  <body>

    <div class="navbar">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Alexander Bulimov&#39;s blog</a>
          <ul class="nav">
              
                <li><a href="/archive">Статьи</a></li>
              
              
                <li><a href="/tags">Теги</a></li>
              
              
                <li><a href="/categories">Категории</a></li>
              
              
                <li><a href="/about">Обо мне</a></li>
              
          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        <div class="row-fluid">
  <div class="span12">
      <div class="posts">
        <h3 class="title"><a href="/it/monitoring-sucks">Monitoring sucks!</a> <span class="date">2013-07-10</span></h3>

        <div class="summary ellipsis">
<p>&#1042; 2012 &#1075;&#1086;&#1076;&#1091; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1089;&#1103; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; devops &#1090;&#1072;&#1082;&#1086;&#1081; &#1093;&#1077;&#1096;&#1090;&#1077;&#1075;, #monitoringsucks.
&#1042; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089; &#1101;&#1090;&#1080;&#1084; &#1090;&#1077;&#1075;&#1086;&#1084; devops&#1099; &#1087;&#1080;&#1089;&#1072;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1077;&#1083;
&#1074; &#1089;&#1092;&#1077;&#1088;&#1077; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;&#1072; &#1080;&#1093; &#1085;&#1077; &#1091;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;. &#1063;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; - &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1086; &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;
<a href="https://speakerdeck.com/obfuscurity/the-state-of-open-source-monitoring">&#1101;&#1090;&#1072; &#1087;&#1088;&#1077;&#1079;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</a>
&#1045;&#1089;&#1083;&#1080; &#1074;&#1082;&#1088;&#1072;&#1090;&#1094;&#1077; - &#1093;&#1086;&#1095;&#1077;&#1090;&#1089;&#1103; &#1083;&#1102;&#1076;&#1103;&#1084; &#1085;&#1077;&#1082;&#1086;&#1077;&#1075;&#1086; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072; API &#1076;&#1083;&#1103; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;
&#1091;&#1090;&#1080;&#1083;&#1080;&#1090; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;&#1072;, &#1085;&#1091; &#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1072;&#1084;&#1080;&#1093; &#1101;&#1090;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1095;&#1090;&#1086;&#1073; &#1080;&#1079; &#1085;&#1080;&#1093; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100;
&#1075;&#1080;&#1073;&#1082;&#1080;&#1081; &#1080; &#1091;&#1084;&#1085;&#1099;&#1081; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;.</p>

<p>&#1048;&#1090;&#1086;&#1075;&#1086;&#1084; &#1101;&#1090;&#1086;&#1081; &#1074;&#1086;&#1083;&#1085;&#1099; &#1085;&#1077;&#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1089;&#1090;&#1074;&#1072; &#1089;&#1090;&#1072;&#1083;&#1080; &#1084;&#1072;&#1089;&#1089;&#1086;&#1074;&#1099;&#1077; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;
&#1080; &#1087;&#1088;&#1080;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103; &#1082; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1084; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1072;&#1084; &#1090;&#1080;&#1087;&#1072; <a href="http://sensuapp.org/">Sensu</a>
&#1080; <a href="http://riemann.io/">Riemann</a>.</p>

<p>&#1042; 2013 &#1075;&#1086;&#1076;&#1091; &#1093;&#1077;&#1096;&#1090;&#1077;&#1075; &#1074; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103; - &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1101;&#1090;&#1086; #monitoringlove.
&#1055;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086; &#1101;&#1090;&#1086; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1102; opensource-&#1091;&#1090;&#1080;&#1083;&#1080;&#1090; &#1076;&#1083;&#1103; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;&#1072;.
&#1043;&#1083;&#1103;&#1076;&#1103; &#1085;&#1072; &#1074;&#1089;&#1077;&#1086;&#1073;&#1097;&#1077;&#1077; &#1074;&#1086;&#1086;&#1076;&#1091;&#1096;&#1077;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1103; &#1088;&#1077;&#1096;&#1080;&#1083; &#1074; &#1088;&#1072;&#1084;&#1082;&#1072;&#1093; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;
&#1086;&#1090;&#1088;&#1080;&#1085;&#1091;&#1090;&#1100; &#1074;&#1077;&#1088;&#1086;&#1081; &#1080; &#1087;&#1088;&#1072;&#1074;&#1076;&#1086;&#1081; &#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1096;&#1080;&#1081; &#1084;&#1085;&#1077; 2 &#1075;&#1086;&#1076;&#1072; <a href="http://www.zabbix.com">Zabbix</a>,
&#1080; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1090;&#1077;&#1093; &#1078;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Sensu.
Riemann &#1103; &#1085;&#1077; &#1089;&#1090;&#1072;&#1083; &#1074;&#1089;&#1077;&#1088;&#1100;&#1077;&#1079; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;
&#1091; &#1085;&#1077;&#1075;&#1086; &#1085;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1076;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1086;&#1089;&#1090;&#1080;, &#1076;&#1072; &#1080;
&#1089;&#1072;&#1084;&#1072; &#1080;&#1076;&#1077;&#1103; &#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075; &#1085;&#1072; &#1082;&#1072;&#1082;&#1086;&#1084;-&#1083;&#1080;&#1073;&#1086; &#1103;&#1079;&#1099;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1072; &#1091;&#1078; &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1085;&#1072; Clojure) &#1087;&#1086;&#1088;&#1086;&#1095;&#1085;&#1072;.</p>
</div>

        <div class="more">
          <a href="/it/monitoring-sucks" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9D%D0%B8%D0%B7%D0%BA%D0%BE%D1%83%D1%80%D0%BE%D0%B2%D0%BD%D0%B5%D0%B2%D0%BE%D0%B5-%D0%BE%D0%B1%D0%BD%D0%B0%D1%80%D1%83%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B2-zabbix">Низкоуровневое обнаружение в Zabbix</a> <span class="date">2013-06-26</span></h3>

        <div class="summary ellipsis">
<p>&#1042; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1084;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;&#1072; Zabbix, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 2.0,
&#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1072;&#1089;&#1100; &#1090;&#1072;&#1082;&#1072;&#1103; &#1083;&#1102;&#1073;&#1086;&#1087;&#1099;&#1090;&#1085;&#1072;&#1103; &#1096;&#1090;&#1091;&#1082;&#1072;, &#1082;&#1072;&#1082; <a href="https://www.zabbix.com/documentation/ru/2.0/manual/discovery/low_level_discovery">&#1085;&#1080;&#1079;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1086;&#1077; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</a></p>

<p>&#1071; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091; &#1087;&#1077;&#1088;&#1077;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;, &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1078;&#1091; &#1083;&#1091;&#1095;&#1096;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1103; &#1087;&#1080;&#1089;&#1072;&#1083; &#1089;&#1074;&#1086;&#1081; &#1090;&#1080;&#1087;
&#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1084;&#1086;&#1085;&#1080;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;&#1072; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1077;&#1081; RabbitMQ.</p>

<p>&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1077;&#1081; &#1074; RabbitMQ &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086;, &#1080;, &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1103; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;,
&#1086;&#1085;&#1080; &#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;. &#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1103; &#1088;&#1077;&#1096;&#1080;&#1083; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1083; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081; &#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088;
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1073;&#1073;&#1080;&#1082;&#1089;&#1072;.</p>

<p>&#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;:</p>

<ol>
<li>&#1055;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; vhost&#1086;&#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; <code>rabbitmqctl -q list_vhosts name</code>
</li>
<li>&#1055;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; vhost &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1077;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; <code>rabbitmqctl -q list_queues -p %vhost name</code>
</li>
<li>&#1054;&#1090;&#1076;&#1072;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1099; vhost:queue &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; JSON</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;&#1093; &#1079;&#1072;&#1073;&#1073;&#1080;&#1082;&#1089;&#1072;, &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <em>&#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</em>
</li>
<li>PROFIT!</li>
</ol>
<p>&#1053;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1074;&#1088;&#1086;&#1076;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;:</p>

<pre>
{
  "data": [
    {"{#RABBITMQ_VHOST_NAME}": "/", "{#RABBITMQ_QUEUE_NAME}": "hello"},
    {"{#RABBITMQ_VHOST_NAME}": "/", "{#RABBITMQ_QUEUE_NAME}": "world"}
  ]
}
</pre>
</div>

        <div class="more">
          <a href="/it/%D0%9D%D0%B8%D0%B7%D0%BA%D0%BE%D1%83%D1%80%D0%BE%D0%B2%D0%BD%D0%B5%D0%B2%D0%BE%D0%B5-%D0%BE%D0%B1%D0%BD%D0%B0%D1%80%D1%83%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B2-zabbix" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD-%D0%BA-ruhoh-%D0%B4%D0%BB%D1%8F-%D1%80%D0%B8%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F-%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D0%BA%D0%BE%D0%B2">Плагин к Ruhoh для рисования графиков</a> <span class="date">2013-06-21</span></h3>

        <div class="summary ellipsis">
<p>&#1045;&#1097;&#1077; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1075;&#1072; &#1085;&#1072; Hakyll &#1103; &#1093;&#1086;&#1090;&#1077;&#1083; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
&#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1074; "&#1085;&#1072; &#1083;&#1077;&#1090;&#1091;" &#1080;&#1079; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1053;&#1086; &#1089; Hakyll &#1085;&#1077; &#1089;&#1083;&#1086;&#1078;&#1080;&#1083;&#1086;&#1089;&#1100;,
&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1076;&#1086;&#1083;&#1075;&#1080;&#1093; &#1087;&#1086;&#1080;&#1089;&#1082;&#1086;&#1074; &#1103; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1089;&#1103; &#1085;&#1072; <a href="http://ruhoh.com/">Ruhoh</a>.</p>

<p>&#1042;&#1089;&#1077; &#1085;&#1080;&#1078;&#1077;&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; <strong>Ruhoh 2.1</strong></p>

<h3 id="toc_0">&#1062;&#1077;&#1083;&#1100;</h3>

<p>&#1056;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1080; &#1080;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1086;-&#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077;.
&#1053;&#1091;&#1078;&#1085;&#1086; &#1084;&#1085;&#1077; &#1101;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1076;&#1083;&#1103; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1089;&#1074;&#1086;&#1080;&#1093; &#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1090;&#1088;&#1077;&#1085;&#1080;&#1088;&#1086;&#1074;&#1086;&#1082;.</p>

<h3 id="toc_1">&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;</h3>

<p>&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1103; &#1088;&#1077;&#1096;&#1080;&#1083; &#1086;&#1092;&#1086;&#1088;&#1084;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1072; &#1082; Ruhoh, &#1073;&#1083;&#1072;&#1075;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1072;&#1082;&#1072;&#1103; &#1077;&#1089;&#1090;&#1100;,
&#1076;&#1072; &#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1103; &#1083;&#1102;&#1073;&#1083;&#1102;. &#1071;&#1079;&#1099;&#1082; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; Ruby, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1089;&#1072;&#1084; Ruhoh &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; Ruby.</p>

<p>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1085;&#1077; &#1073;&#1083;&#1077;&#1097;&#1077;&#1090;, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1096;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1082;&#1086;&#1087;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077; Ruhoh.</p>

<p>&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1089;&#1103; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;, &#1073;&#1077;&#1088;&#1091;&#1097;&#1080;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; yaml-&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1080; &#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1087;&#1086; &#1085;&#1080;&#1084; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1080;
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <a href="http://rubygems.org/gems/gruff">gruff</a>.</p>

</div>

        <div class="more">
          <a href="/it/%D0%9F%D0%BB%D0%B0%D0%B3%D0%B8%D0%BD-%D0%BA-ruhoh-%D0%B4%D0%BB%D1%8F-%D1%80%D0%B8%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F-%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D0%BA%D0%BE%D0%B2" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%98-%D1%81%D0%BD%D0%BE%D0%B2%D0%B0-%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D0%B8">И снова пользователи</a> <span class="date">2013-06-19</span></h3>

        <div class="summary">
<p>&#1071; &#1091;&#1078;&#1077; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1076;&#1072;&#1074;&#1085;&#1086; &#1087;&#1086;&#1085;&#1103;&#1083;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091; &#1080; &#1085;&#1077; &#1093;&#1086;&#1095;&#1091; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1083;&#1102;&#1076;&#1100;&#1084;&#1080;,
&#1080; &#1091;&#1078;&#1077; &#1086;&#1082;&#1086;&#1083;&#1086; &#1075;&#1086;&#1076;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1086;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1085;&#1077; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1089;&#1100;.
&#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1085;&#1072;&#1096; &#1086;&#1092;&#1080;&#1089;&#1085;&#1099;&#1081; &#1089;&#1080;&#1089;&#1072;&#1076;&#1084;&#1080;&#1085; &#1074; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1077;, &#1080; &#1103; &#1074;&#1099;&#1085;&#1091;&#1078;&#1076;&#1077;&#1085; &#1089;&#1085;&#1086;&#1074;&#1072; &#1101;&#1090;&#1080;&#1084; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;&#1089;&#1103;.</p>

<p>&#1042;&#1086;&#1090;, &#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1087;&#1086;&#1076;&#1086;&#1096;&#1083;&#1072; &#1082;&#1086; &#1084;&#1085;&#1077; &#1090;&#1077;&#1090;&#1103; &#1089; &#1087;&#1088;&#1086;&#1089;&#1100;&#1073;&#1086;&#1081; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1074; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;
&#1089; &#1052;&#1060;&#1059; &#1089;&#1082;&#1072;&#1085;&#1072; &#1085;&#1072; email. &#1057;&#1072;&#1084; &#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1083;, &#1085;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077; &#1074;&#1080;&#1076;&#1077;&#1083;,
&#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1079;&#1072;&#1103;&#1074;&#1080;&#1083; &#1077;&#1081;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1082;&#1072;&#1078;&#1091;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;
&#1074;&#1099;&#1103;&#1089;&#1085;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1090;&#1077; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077; &#1085;&#1072;&#1076;&#1086;, &#1095;&#1090;&#1086;&#1073; &#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1083; &#1077;&#1081; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;. &#1045;&#1081; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086;
&#1095;&#1090;&#1086; &#1103; <em>&#1079;&#1072; &#1085;&#1077;&#1077;</em> &#1086;&#1090;&#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083; &#1080; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083; N &#1083;&#1080;&#1089;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1080;&#1095;&#1077;&#1084; &#1085;&#1072; &#1084;&#1086;&#1077; &#1091;&#1076;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1085;&#1072; &#1074;&#1099;&#1076;&#1072;&#1083;&#1072;
&#1087;&#1086;&#1090;&#1088;&#1103;&#1089;&#1072;&#1102;&#1097;&#1091;&#1102; &#1092;&#1088;&#1072;&#1079;&#1091;: "&#1071; &#1078;&#1077; &#1078;&#1077;&#1085;&#1097;&#1080;&#1085;&#1072;, &#1074;&#1099; &#1095;&#1090;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1080; &#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100;, &#1082;&#1072;&#1082; &#1103; &#1089;&#1072;&#1084;&#1072; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1102;?!"
&#1055;&#1086;&#1089;&#1083;&#1077; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1096;&#1077;&#1083;, &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1074; &#1090;&#1077;&#1090;&#1102; &#1085;&#1072; &#1087;&#1086;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1077;&#1088;&#1076;&#1086;&#1073;&#1086;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091;
&#1074;&#1089;&#1077; &#1088;&#1072;&#1074;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077;&#1095;&#1077;&#1084; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103;, &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085; &#1088;&#1074;&#1072;&#1083;&#1089;&#1103; &#1087;&#1086;&#1084;&#1086;&#1095;&#1100; &#1077;&#1081;. &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077;, &#1086;&#1085;&#1072; &#1089;&#1077;&#1083;&#1072; &#1077;&#1084;&#1091; &#1085;&#1072; &#1096;&#1077;&#1102;,
&#1080; &#1086;&#1085; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1083; &#1074;&#1089;&#1077; &#1079;&#1072; &#1085;&#1077;&#1077;, &#1095;&#1077;&#1075;&#1086; &#1086;&#1085;&#1072; &#1080; &#1076;&#1086;&#1073;&#1080;&#1074;&#1072;&#1083;&#1072;&#1089;&#1100;.</p>

<p>&#1071;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1080; &#1089;&#1072;&#1084; &#1090;&#1072;&#1082;&#1086;&#1077; &#1085;&#1077; &#1088;&#1072;&#1079; &#1085;&#1072;&#1073;&#1083;&#1102;&#1076;&#1072;&#1083;, &#1080; &#1077;&#1079;&#1076;&#1080;&#1083;&#1080; &#1085;&#1072; &#1084;&#1085;&#1077; &#1090;&#1072;&#1082; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077;, &#1087;&#1086;&#1082;&#1072; &#1103; &#1085;&#1077; &#1085;&#1072;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; &#1086;&#1087;&#1099;&#1090;&#1072;.
&#1071; &#1076;&#1072;&#1078;&#1077; &#1095;&#1080;&#1090;&#1072;&#1083; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1091; &#1051;&#1080;&#1084;&#1086;&#1085;&#1095;&#1077;&#1083;&#1083;&#1080;. &#1053;&#1086; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1102; &#1091;&#1076;&#1080;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1090;&#1072;&#1082;&#1080;&#1084; &#1087;&#1088;&#1080;&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1083;&#1102;&#1076;&#1103;&#1084;...</p>
</div>

        <div class="more">
          <a href="/it/%D0%98-%D1%81%D0%BD%D0%BE%D0%B2%D0%B0-%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D0%B8" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%A7%D1%82%D0%BE-%D1%8F-%D0%B4%D1%83%D0%BC%D0%B0%D1%8E-%D0%BE-debian-%D0%BD%D0%B0-%D1%81%D0%B5%D1%80%D0%B2%D0%B5%D1%80%D0%B0%D1%85">Что я думаю о Debian на серверах</a> <span class="date">2013-06-18</span></h3>

        <div class="summary ellipsis">
<p>&#1057; 2010 &#1075;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1084; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;,
&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083; &#1082;&#1072;&#1082; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074; Debian.
&#1069;&#1090;&#1086; &#1073;&#1099;&#1083; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1086;&#1089;&#1086;&#1079;&#1085;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088;, &#1080; &#1085;&#1072; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1080; &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103;.
&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1080; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;&#1084;&#1080;, &#1080; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1084;&#1085;&#1077; &#1077;&#1089;&#1090;&#1100; &#1080; &#1073;&#1099;&#1083;&#1086; &#1089; &#1095;&#1077;&#1084; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1090;&#1100;.
&#1055;&#1086; &#1080;&#1090;&#1086;&#1075;&#1072;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; Debian &#1080; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1101;&#1090;&#1072; &#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1072;.</p>

<h1 id="toc_0">&#1053;&#1077;&#1075;&#1072;&#1090;&#1080;&#1074;</h1>

<h2 id="toc_1">&#1054;&#1073;&#1097;&#1077;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1083;&#1080;&#1084;&#1080;&#1090;&#1099;</h2>

<p>&#1042; &#1089;&#1074;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1074;&#1089;&#1090;&#1072;&#1083;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076;&#1086; &#1084;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1086;&#1076; &#1074;&#1099;&#1089;&#1086;&#1082;&#1091;&#1102; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1086;&#1074;,
&#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; PostgreSQL + pgbouncer. &#1048; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1084;&#1085;&#1077; &#1085;&#1072;&#1076;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1086;&#1076;&#1090;&#1102;&#1085;&#1080;&#1090;&#1100; &#1083;&#1080;&#1084;&#1080;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;
&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; postgres, &#1095;&#1090;&#1086; &#1103; &#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1083;&#1089;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1074;
<strong>/etc/security/limits.conf</strong>. &#1053;&#1086; &#1090;&#1086;&#1083;&#1082;&#1091; &#1089; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086;, cat /proc/$PID/limits &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083;
&#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; <strong>Max open files</strong> &#1074;&#1089;&#1077; &#1090;&#1086; &#1078;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; - 1024 &#1092;&#1072;&#1081;&#1083;&#1072;, &#1093;&#1086;&#1090;&#1103; ulimit -n &#1086;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;
postgres &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; (&#1087;&#1086;&#1089;&#1083;&#1077; su - postgres)</p>

<p>&#1071;, &#1073;&#1099;&#1083; &#1091;&#1076;&#1080;&#1074;&#1083;&#1077;&#1085;, &#1080; &#1087;&#1086;&#1083;&#1077;&#1079; &#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1044;&#1083;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; - &#1074; /etc/pam.d
&#1058;&#1072;&#1084; &#1103; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1072;
<code>session    required   pam_limits.so</code>
&#1074; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1093; &#1076;&#1083;&#1103; &#1085;&#1086;&#1074;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1074;&#1077;&#1079;&#1076;&#1077;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1076;&#1083;&#1103; su.
&#1071; &#1101;&#1090;&#1091; &#1089;&#1090;&#1088;&#1086;&#1095;&#1082;&#1091; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081;, &#1088;&#1072;&#1076;&#1080; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;.
&#1053;&#1086; &#1090;&#1086;&#1083;&#1082;&#1091; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086; - &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074;&#1089;&#1077; &#1090;&#1072;&#1082; &#1078;&#1077; &#1089; &#1083;&#1080;&#1084;&#1080;&#1090;&#1086;&#1084; 1024.</p>
</div>

        <div class="more">
          <a href="/it/%D0%A7%D1%82%D0%BE-%D1%8F-%D0%B4%D1%83%D0%BC%D0%B0%D1%8E-%D0%BE-debian-%D0%BD%D0%B0-%D1%81%D0%B5%D1%80%D0%B2%D0%B5%D1%80%D0%B0%D1%85" class="btn btn-small">read more..</a>
        </div>
      </div>
    
    <div class="pagination">
      <ul>
          <li><a href="/">1</a></li>
          <li><a href="/posts/index/2">2</a></li>
          <li><a href="/posts/index/3">3</a></li>
          <li class="active"><a href="/posts/index/4">4</a></li>
          <li><a href="/posts/index/5">5</a></li>
      </ul>
    </div>
  </div>
</div>

      </div>

      <hr>
      <div class="footer">
          <p>&copy; <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/"><img alt="Creative Commons License" style="border-width:0" src="http://i.creativecommons.org/l/by-sa/3.0/80x15.png" /></a> Alexander Bulimov
          with help from <a href="http://ruhoh.com" target="_blank" title="The Definitive Technical Blogging Framework">ruhoh</a>
          and <a href="http://twitter.github.com/bootstrap/" target="_blank">Twitter Bootstrap</a>
        </p>
      </div>

    </div> <!-- /container -->

    <!-- Google Prettify -->
<script src="http://cdnjs.cloudflare.com/ajax/libs/prettify/188.0.0/prettify.js"></script>
<script>
  var pres = document.getElementsByTagName("pre");
  for (var i=0; i < pres.length; ++i) {
    pres[i].className = "prettyprint linenums";
  }
  prettyPrint();
</script>
<!-- end Google Prettify -->
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-49230997-1']);
  _gaq.push(['_trackPageview']);
  

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>



  </body>
</html>
