<?xml version="1.0"?>
<rss version="2.0">
  <channel>
    <title>Alexander Bulimov's blog</title>
    <description>Alexander Bulimov's blog</description>
    <link>http://bulimov.ru</link>
    <pubDate>2014-04-17</pubDate>
    <item>
      <title>&#x41F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x43B; The Phoenix Project: A Novel About IT, DevOps, and Helping Your Business Win</title>
      <link>http://bulimov.ru/it/%D0%9F%D1%80%D0%BE%D1%87%D0%B8%D1%82%D0%B0%D0%BB-the-phoenix-project-a-novel-about-it-devops-and-helping-your-business-win</link>
      <pubDate>2014-04-15</pubDate>
      <description>&lt;p&gt;&#x41D;&#x443; &#x447;&#x442;&#x43E; &#x442;&#x443;&#x442; &#x441;&#x43A;&#x430;&#x436;&#x435;&#x448;&#x44C; - &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x430;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430;. &#x41D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x436;&#x438;&#x432;&#x44B;&#x43C; &#x44F;&#x437;&#x44B;&#x43A;&#x43E;&#x43C;, &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F;.
&#x412; &#x443;&#x432;&#x43B;&#x435;&#x43A;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x435; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43E; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x430;&#x445; DevOps,
&#x43F;&#x440;&#x438;&#x447;&#x435;&#x43C; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x442;&#x430;&#x43A;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x431;&#x44B;&#x43B;&#x43E; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x43E;, &#x432; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x43D;&#x430; &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x44B; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439;
&#x438;&#x437; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x43E;&#x432; &#x431;&#x44B;&#x43B; &#x441;&#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;.&lt;/p&gt;

&lt;p&gt;&#x41A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;, &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x43A;&#x43D;&#x438;&#x433;&#x438; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; DevOps &#x43F;&#x440;&#x435;&#x43F;&#x43E;&#x434;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A;
&#x43D;&#x435;&#x43A;&#x430;&#x44F; &#x447;&#x443;&#x434;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x44F;, &#x438; &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x43D;&#x435; &#x443;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x44F;
&#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x443; - &#x43A;&#x430;&#x434;&#x440;&#x43E;&#x432;&#x43E;&#x43C;&#x443;. &#x412; &#x43A;&#x43D;&#x438;&#x433;&#x435; &#x432;&#x441;&#x435; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;&#x438; &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x438;&#x441;&#x44C;
&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43A;&#x432;&#x430;&#x43B;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x438; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x44C; &#x438;
&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x430;&#x434;&#x438;&#x433;&#x43C;&#x443; DevOps, &#x445;&#x43E;&#x442;&#x44F; &#x432; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x436;&#x438;&#x437;&#x43D;&#x438; &#x43B;&#x438;&#x447;&#x43D;&#x43E; &#x44F;
&#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x44E; &#x436;&#x435;&#x441;&#x442;&#x43E;&#x447;&#x430;&#x439;&#x448;&#x438;&#x439; &#x434;&#x435;&#x444;&#x438;&#x446;&#x438;&#x442; &#x430;&#x434;&#x435;&#x43A;&#x432;&#x430;&#x442;&#x43D;&#x44B;&#x445; &#x43A;&#x430;&#x434;&#x440;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x445;&#x43E;&#x442;&#x44F;-&#x431;&#x44B;
&#x43F;&#x435;&#x440;&#x435;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x434; DevOps, &#x43D;&#x435; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F; &#x443;&#x436;&#x435; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E;&#x431; &#x43E;&#x43D;&#x438; &#x441;&#x430;&#x43C;&#x438; &#x43A; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x448;&#x43B;&#x438;.
&#x418; &#x434;&#x430;&#x436;&#x435; &#x433;&#x440;&#x430;&#x43C;&#x43E;&#x442;&#x43D;&#x44B;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x44B; &#x432; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x43E;&#x431;&#x43B;&#x430;&#x434;&#x430;&#x44E;&#x442; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x439;
&#x438;&#x43D;&#x435;&#x440;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43C;&#x44B;&#x448;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43C;&#x435;&#x448;&#x430;&#x435;&#x442; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x432;&#x435;&#x442;&#x430;&#x43C;, &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;
&#x432; &#x44D;&#x442;&#x43E;&#x439; &#x43A;&#x43D;&#x438;&#x433;&#x435;.&lt;/p&gt;

&lt;p&gt;&#x41D;&#x435;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x44F; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x44F;&#x432;&#x43D;&#x44B;&#x439; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x43A;, &#x44F; &lt;strong&gt;&#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E;&lt;/strong&gt; &#x44D;&#x442;&#x443; &#x43A;&#x43D;&#x438;&#x433;&#x443; &#x43A; &#x43F;&#x440;&#x43E;&#x447;&#x442;&#x435;&#x43D;&#x438;&#x44E; &#x432;&#x441;&#x435;&#x43C;
IT-&#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x430;&#x43C;.&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x421;&#x434;&#x430;&#x43B; &#x44D;&#x43A;&#x437;&#x430;&#x43C;&#x435;&#x43D; Cisco ICND2, &#x43E;&#x43D; &#x436;&#x435; 200-101</title>
      <link>http://bulimov.ru/it/%D0%A1%D0%B4%D0%B0%D0%BB-%D1%8D%D0%BA%D0%B7%D0%B0%D0%BC%D0%B5%D0%BD-cisco-icnd2-%D0%BE%D0%BD-%D0%B6%D0%B5-200-101</link>
      <pubDate>2014-04-03</pubDate>
      <description>&lt;p&gt;&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x44F; CCNA.&lt;/p&gt;

&lt;p&gt;&#x421;&#x434;&#x430;&#x43B; &#x441; &#x442;&#x440;&#x443;&#x434;&#x43E;&#x43C;, 867 &#x438;&#x437; 1000 &#x43F;&#x440;&#x438; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x445; 825.
&#x42D;&#x43A;&#x437;&#x430;&#x43C;&#x435;&#x43D; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x43E;&#x449;&#x43D;&#x44B;&#x439;, &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x435;&#x435; ICND1, &#x43D;&#x430; &#x43C;&#x43E;&#x439; &#x432;&#x43A;&#x443;&#x441;.
&#x41D;&#x430;&#x434;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x441;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x434;&#x438;&#x43D;&#x44B;&#x439; 200-120, &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435;.
&#x415;&#x449;&#x435; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x443;&#x432;&#x435;&#x440;&#x438;&#x43B;&#x441;&#x44F;, &#x447;&#x442;&#x43E; CCNA &#x432;&#x43F;&#x43E;&#x43B;&#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43D;&#x430; &#x440;&#x43E;&#x43B;&#x44C;
&#x43A;&#x440;&#x438;&#x442;&#x435;&#x440;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x444;&#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435;-&#x43C;&#x435;&#x43D;&#x435;&#x435; &#x441;&#x435;&#x440;&#x44C;&#x435;&#x437;&#x43D;&#x43E;&#x439;
&#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441;&#x438;&#x441;&#x430;&#x434;&#x43C;&#x438;&#x43D;&#x430;.&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x421;&#x434;&#x430;&#x43B; &#x44D;&#x43A;&#x437;&#x430;&#x43C;&#x435;&#x43D; Cisco ICND1, &#x43E;&#x43D; &#x436;&#x435; 100-101</title>
      <link>http://bulimov.ru/it/%D0%A1%D0%B4%D0%B0%D0%BB-%D1%8D%D0%BA%D0%B7%D0%B0%D0%BC%D0%B5%D0%BD-cisco-icnd1-%D0%BE%D0%BD-%D0%B6%D0%B5-100-101</link>
      <pubDate>2014-03-20</pubDate>
      <description>&lt;p&gt;&#x421;&#x434;&#x430;&#x432;&#x430;&#x43B; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x441;&#x44F;&#x446; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43A;&#x443;&#x440;&#x441;&#x43E;&#x432; ICND1 &#x438; ICND2, &#x43D;&#x430;&#x431;&#x440;&#x430;&#x43B; 907.
&#x42D;&#x43A;&#x437;&#x430;&#x43C;&#x435;&#x43D; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x439;, &#x43C;&#x43E;&#x449;&#x43D;&#x44B;&#x439;. &#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x432;&#x43F;&#x43E;&#x43B;&#x43D;&#x435; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x44E;,
&#x43F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x43C;&#x438; &#x441;&#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; CCNA &#x440;&#x430;&#x441;&#x446;&#x435;&#x43D;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x43D;&#x435;&#x43A;&#x43E;&#x435; &#x43C;&#x435;&#x440;&#x438;&#x43B;&#x43E;
&#x43F;&#x440;&#x43E;&#x444;&#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x438;.&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; Ansible Playbook</title>
      <link>http://bulimov.ru/it/%D0%A2%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5-ansible-playbook</link>
      <pubDate>2014-03-13</pubDate>
      <description>&lt;p&gt;&#x414;&#x430;&#x432;&#x43D;&#x43E; &#x445;&#x43E;&#x442;&#x435;&#x43B; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x430;&#x432;&#x442;&#x43E;-&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x446;&#x435;&#x43B;&#x43E;&#x441;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x440;&#x430;&#x437;&#x432;&#x435;&#x440;&#x442;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x433;&#x43E;
&#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &lt;a href="http://ansible.com"&gt;Ansible&lt;/a&gt;. &#x427;&#x442;&#x43E;&#x431;&#x44B;, &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x437;&#x430;&#x43F;&#x443;&#x448;&#x438;&#x43B; &#x44F; &#x43D;&#x43E;&#x432;&#x443;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x43F;&#x43B;&#x435;&#x439;&#x431;&#x443;&#x43A;&#x430; &#x432; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x44F;,
&#x438; CI &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x43B;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x43E;&#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;. &#x41F;&#x440;&#x438;&#x447;&#x435;&#x43C; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x430;,
&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x43E;&#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x433;&#x43E; &#x434;&#x435;&#x43F;&#x43B;&#x43E;&#x44F;.&lt;/p&gt;

&lt;p&gt;&#x412;&#x43E;&#x442; &#x43D;&#x430;&#x43A;&#x43E;&#x43D;&#x435;&#x446; &#x434;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x448;&#x43B;&#x438; &#x440;&#x443;&#x43A;&#x438;.&lt;/p&gt;

&lt;p&gt;&#x422;&#x43E;&#x447;&#x43D;&#x435;&#x435;, &#x440;&#x443;&#x43A;&#x438; &#x434;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x448;&#x43B;&#x438; &#x435;&#x449;&#x435; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x435; 2013 &#x433;&#x43E;&#x434;&#x430;, &#x43D;&#x43E; &#x442;&#x43E;&#x433;&#x434;&#x430; &#x44F; &#x441;&#x43E;&#x431;&#x440;&#x430;&#x43B; &#x432;&#x441;&#x435; &#x44D;&#x442;&#x43E;
&#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x441;&#x442;&#x440;&#x43E;&#x439;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; &#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x435;&#x439;, &#x432;&#x437;&#x44F;&#x432; &#x437;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x443; &#x437;&#x430;&#x440;&#x430;&#x43D;&#x435;&#x435; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;
&#x441;&#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x435;&#x43D;&#x43D;&#x44B;&#x435; qemu-&#x43E;&#x431;&#x440;&#x430;&#x437;&#x44B; &#x43D;&#x430; lvm-&#x441;&#x43D;&#x430;&#x43F;&#x448;&#x43E;&#x442;&#x430;&#x445;.&lt;/p&gt;

&lt;p&gt;&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x44F; &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43F;&#x43E;&#x434;&#x43E;&#x439;&#x442;&#x438; &#x43A; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x443; &#x441;&#x435;&#x440;&#x44C;&#x435;&#x437;&#x43D;&#x435;&#x435;, &#x432;&#x437;&#x44F;&#x442;&#x44C; &#x43E;&#x431;&#x449;&#x435;&#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x44B;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;
&#x438; &#x438;&#x437;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x442; &#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x435;&#x439;.&lt;/p&gt;

&lt;h5 id="toc_0"&gt;&#x41F;&#x43B;&#x430;&#x43D; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439;&lt;/h5&gt;

&lt;p&gt;&#x412;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x44F;&#x441;&#x44C; &#x43A; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x437;&#x430;&#x434;&#x430;&#x447;&#x435; - &#x447;&#x442;&#x43E; &#x436;&#x435; &#x43D;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x435;&#x43F;&#x43B;&#x43E;&#x44F; &#x441; &#x43D;&#x443;&#x43B;&#x44F;?&lt;/p&gt;

&lt;ol&gt;
&lt;li&gt;&#x411;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x437; &#x443;&#x436;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;&lt;/li&gt;
&lt;li&gt;&#x418;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x43A;&#x438; &#x438;&#x437; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x430; &#x441; &#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C;
&#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x445; &#x441;&#x435;&#x442;&#x435;&#x432;&#x44B;&#x445; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43A; &#x438; &#x445;&#x43E;&#x441;&#x442;&#x43D;&#x435;&#x439;&#x43C;&#x430;.&lt;/li&gt;
&lt;li&gt;&#x421;&#x43A;&#x440;&#x438;&#x43F;&#x442; &#x434;&#x43B;&#x44F; CI, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x435;&#x441;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x43A;&#x438;, &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x43D;&#x438;&#x445; &#x434;&#x435;&#x43F;&#x43B;&#x43E;&#x439;,
&#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x442;&#x44C; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x430;.&lt;/li&gt;
&lt;/ol&gt;

&lt;h5 id="toc_1"&gt;&#x41F;&#x443;&#x43D;&#x43A;&#x442; 1&lt;/h5&gt;

&lt;p&gt;&#x414;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x430; &#x44F; &#x441;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x432;&#x437;&#x44F;&#x43B; &lt;a href="https://github.com/jedi4ever/veewee"&gt;Veewee&lt;/a&gt;, &#x43D;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x438;&#x43B; &#x435;&#x433;&#x43E; &#x43D;&#x430; &lt;a href="http://packer.io"&gt;Packer&lt;/a&gt;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x441;&#x44F;
&#x43C;&#x43D;&#x435; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x43D;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x43C; &#x438; &#x43B;&#x438;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x435;&#x439; veewee.
&#x41E;&#x431;&#x430; &#x44D;&#x442;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x431;&#x435;&#x440;&#x443;&#x442; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43E;&#x447;&#x43D;&#x44B;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x437; &#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x43C; &#x434;&#x438;&#x441;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x438;&#x432;&#x430;,
&#x432; &#x43C;&#x43E;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; Debian Wheezy, &#x438; &#x43F;&#x43E; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x44E;&#x442; &#x43E;&#x431;&#x440;&#x430;&#x437; &#x441; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43E;&#x439;.
&#x414;&#x43B;&#x44F; Debian &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; preseed &#x438; &#x43D;&#x430;&#x431;&#x43E;&#x440; bash-&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x43E;&#x432;.&lt;/p&gt;

&lt;h5 id="toc_2"&gt;&#x41F;&#x443;&#x43D;&#x43A;&#x442; 2&lt;/h5&gt;

&lt;p&gt;&#x414;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x430; &#x44F; &#x432;&#x437;&#x44F;&#x43B; &lt;a href="http://vagrantup.com"&gt;Vagrant&lt;/a&gt;.
&#x41A; &#x441;&#x43E;&#x436;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x44E;, &#x438;&#x437; &#x43A;&#x43E;&#x440;&#x43E;&#x431;&#x43A;&#x438; Vagrant &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; qemu-kvm
&#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x433;&#x438;&#x43F;&#x435;&#x440;&#x432;&#x438;&#x437;&#x43E;&#x440;&#x430;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x448;&#x43B;&#x43E;&#x441;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x436;&#x435;
&#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D; &lt;a href="https://github.com/pradels/vagrant-libvirt"&gt;vagrant-libvirt&lt;/a&gt;.
&#x414;&#x43B;&#x44F; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x438;&#x438; &#x432; &#x43E;&#x431;&#x440;&#x430;&#x437; &#x434;&#x43B;&#x44F; Vagrant &#x443; Packer&#x430; &#x435;&#x441;&#x442;&#x44C; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x44B;&#x439; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;,
&#x43D;&#x43E; &#x441; qemu-kvm &#x43E;&#x43D; &#x442;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442;, &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x437; &#x44F; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x44E; &#x43F;&#x43E;
&lt;a href="https://github.com/pradels/vagrant-libvirt/tree/master/example_box"&gt;&#x44D;&#x442;&#x43E;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438;&lt;/a&gt;.
&#x425;&#x43E;&#x447;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43E;&#x442; Vagrant &#x43C;&#x43D;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435;-&#x443;&#x43D;&#x438;&#x447;&#x442;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x43E;&#x43A;
&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x435;&#x439;&#x448;&#x435;&#x435; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; - &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430; &#x441;&#x435;&#x442;&#x438; &#x438; &#x445;&#x43E;&#x441;&#x442;&#x43D;&#x435;&#x439;&#x43C;&#x430;. Provisioning
&#x441; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; Vagrant &#x438; Ansible &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x435;&#x433;&#x43E; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; -
Vagrant &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x433;&#x440;&#x443;&#x43F;&#x43F; &#x438; &#x445;&#x43E;&#x441;&#x442;&#x43E;&#x432; &#x434;&#x43B;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x43A;&#x438; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;,
&#x430; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x43C;&#x43E;&#x438;&#x445; playbook&#x43E;&#x432; &#x43D;&#x443;&#x436;&#x43D;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x445;&#x43E;&#x441;&#x442;&#x44B; &#x437;&#x43D;&#x430;&#x43B;&#x438; &#x434;&#x440;&#x443;&#x433; &#x43E; &#x434;&#x440;&#x443;&#x433;&#x435;.&lt;/p&gt;

&lt;h5 id="toc_3"&gt;&#x41F;&#x443;&#x43D;&#x43A;&#x442; 3&lt;/h5&gt;

&lt;p&gt;&#x422;&#x440;&#x435;&#x442;&#x438;&#x439; &#x43F;&#x443;&#x43D;&#x43A;&#x442; - &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &amp;quot;&#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x44C;&#x43D;&#x44B;&#x439;&amp;quot;, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435;
&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x430; &#x434;&#x43B;&#x44F; CI (&#x432; &#x43C;&#x43E;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; - CruiseControl.rb). &#x421;&#x43A;&#x438;&#x43F;&#x442; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430;&#x44F;
&#x435;&#x433;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430; - &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x432;&#x44B;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x43E;&#x442;&#x440;&#x435;&#x441;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x440;&#x442;&#x443;&#x430;&#x43B;&#x43A;&#x438;, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C;
&#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; 3 playbook&#x430; &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x43E; &#x433;&#x440;&#x443;&#x43F;&#x43F;&#x44B; &#x445;&#x43E;&#x441;&#x442;&#x43E;&#x432;, &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x44F;
&#x43A;&#x43E;&#x434;&#x44B; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x442;&#x430; Ansible.&lt;/p&gt;

&lt;h5 id="toc_4"&gt;&#x418;&#x442;&#x43E;&#x433;&lt;/h5&gt;

&lt;p&gt;&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435;, &#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B; &#x440;&#x43E;&#x432;&#x43D;&#x43E; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x438; &#x445;&#x43E;&#x442;&#x435;&#x43B; - &#x43D;&#x430; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43C;&#x438;&#x442; &#x432; &#x440;&#x435;&#x43F;&#x43E;&#x437;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x439; &#x441; &#x43F;&#x43B;&#x435;&#x439;&#x431;&#x443;&#x43A;&#x430;&#x43C;&#x438;
&#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x435; &#x440;&#x430;&#x437;&#x432;&#x435;&#x440;&#x442;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x430; &#x433;&#x43E;&#x43B;&#x44B;&#x435; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43A;&#x438;. &#x417;&#x430;&#x442;&#x435;&#x43C;
&#x432;&#x441;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x441;&#x44F; &#x432; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x43C;&#x43E;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; - &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x442;&#x435;&#x440;&#x44B;,
&#x43D;&#x430;&#x441;&#x442;&#x440;&#x430;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x435;&#x43F;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; - &#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A; &#x432;&#x441;&#x435;&#x445; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x43E;&#x432; &#x438; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438;&#x445;
&#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x441;&#x442;&#x430;&#x440;&#x442;&#x430;. &#x412; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C; &#x44F; &#x43F;&#x43B;&#x430;&#x43D;&#x438;&#x440;&#x443;&#x44E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x442;&#x435;&#x441;&#x442;&#x44B;, &#x43B;&#x43E;&#x43C;&#x430;&#x44E;&#x449;&#x438;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443;
&#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x44E;&#x449;&#x438;&#x439; &#x43E;&#x442;&#x43A;&#x430;&#x437;&#x43E;&#x443;&#x441;&#x442;&#x43E;&#x439;&#x447;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x442;&#x440;&#x443;&#x434;&#x43E;&#x437;&#x430;&#x442;&#x440;&#x430;&#x442; &#x43E;&#x442; &#x43D;&#x430;&#x448;&#x438;&#x445;
&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x438; &#x442;&#x430;&#x43A; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43D;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x44B;.&lt;/p&gt;
</description>
    </item>
    <item>
      <title>&#x412;&#x43B;&#x438;&#x44F;&#x43D;&#x438;&#x435; &#x43A;&#x443;&#x440;&#x441;&#x43E;&#x432; Cisco &#x43D;&#x430; &#x43F;&#x441;&#x438;&#x445;&#x438;&#x43A;&#x443;</title>
      <link>http://bulimov.ru/it/%D0%92%D0%BB%D0%B8%D1%8F%D0%BD%D0%B8%D0%B5-%D0%BA%D1%83%D1%80%D1%81%D0%BE%D0%B2-cisco-%D0%BD%D0%B0-%D0%BF%D1%81%D0%B8%D1%85%D0%B8%D0%BA%D1%83</link>
      <pubDate>2014-03-05</pubDate>
      <description>&lt;p&gt;&#x417;&#x430;&#x43A;&#x43E;&#x43D;&#x447;&#x438;&#x43B; &#x43A;&#x443;&#x440;&#x441;&#x44B; Cisco ICND1 &#x438; ICND2, &#x438; &#x441;&#x440;&#x430;&#x437;&#x443; &#x437;&#x430;&#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;.
&#x417;&#x430;&#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x43E;&#x43C;&#x43E;&#x439; &#x43A;&#x430;&#x43A;&#x443;&#x44E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x443;&#x44E; &#x441;&#x435;&#x442;&#x435;&#x432;&#x443;&#x44E; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x44F;&#x43A;&#x443;.
&#x411;&#x44B;&#x441;&#x442;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x438;&#x441;&#x43A; &#x43F;&#x43E; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x430;&#x43C; &#x441;&#x435;&#x440;&#x44C;&#x435;&#x437;&#x43D;&#x44B;&#x445; &#x444;&#x438;&#x440;&#x43C; &#x442;&#x438;&#x43F;&#x430; Cisco &#x438; Juniper &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;, &#x447;&#x442;&#x43E;
&#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x432;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x43C;&#x43E;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x43C;&#x430;&#x448;&#x43D;&#x435;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x443; &#x43D;&#x438;&#x445; &#x43D;&#x435;&#x442;
(Cisco Linksys &#x44F; &#x437;&#x430; &#x432;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x43C;&#x43E;&#x435; &#x43D;&#x435; &#x441;&#x447;&#x438;&#x442;&#x430;&#x44E;, &#x442;&#x430; &#x436;&#x435; &#x444;&#x438;&#x433;&#x43D;&#x44F;, &#x447;&#x442;&#x43E; &#x438; D-Link &#x438;&#x43B;&#x438; Asus).
&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x44D;&#x442;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x430;&#x43D;&#x438;&#x439;, &#x432;&#x44B;&#x431;&#x43E;&#x440; &#x43F;&#x430;&#x43B; &#x43D;&#x430; &#x43E;&#x431;&#x43E;&#x440;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x444;&#x438;&#x440;&#x43C;&#x44B; MikroTik.&lt;/p&gt;

&lt;p&gt;&#x414;&#x432;&#x438;&#x436;&#x438;&#x43C;&#x44B;&#x439; &#x434;&#x443;&#x448;&#x435;&#x432;&#x43D;&#x44B;&#x43C; &#x43F;&#x43E;&#x440;&#x44B;&#x432;&#x43E;&#x43C;, &#x44F; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x43B;
&#x441;&#x432;&#x43E;&#x439; &#x434;&#x440;&#x435;&#x432;&#x43D;&#x438;&#x439; WiFi &#x440;&#x43E;&#x443;&#x442;&#x435;&#x440; D-Link DIR-615 c DD-WRT &#x43D;&#x430; &#x431;&#x43E;&#x440;&#x442;&#x443; &#x43D;&#x430; MikroTik RouterBoard RB951G-2HnD.
&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B; &#x43C;&#x430;&#x441;&#x441;&#x443; &#x443;&#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x43E;&#x442; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438;. CLI &#x443; RouterOS
&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x441;&#x44F; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x43F;&#x440;&#x438;&#x44F;&#x442;&#x43D;&#x44B;&#x43C;, &#x43D;&#x443; &#x430; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x447;&#x435;&#x43C; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E;,
&#x447;&#x442;&#x43E; &#x438; &#x43D;&#x435; &#x443;&#x434;&#x438;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; - &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; &#x443; &#x43D;&#x435;&#x433;&#x43E; Linux.&lt;/p&gt;

&lt;p&gt;&#x420;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x44D;&#x442;&#x430; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x43A;&#x430; &#x443;&#x436;&#x435; &#x432;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x43D;&#x435;&#x434;&#x435;&#x43B;&#x44E;, &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x438;&#x445;, &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;
&#x43E;&#x442;&#x43C;&#x435;&#x43D;&#x43D;&#x430;&#x44F;. &#x415;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x438;&#x43D;&#x443;&#x441; - &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; 5Ghz, &#x43D;&#x43E; &#x441; &#x43D;&#x438;&#x43C; &#x44F; &#x433;&#x43E;&#x442;&#x43E;&#x432; &#x43C;&#x438;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F;.&lt;/p&gt;
</description>
    </item>
  </channel>
</rss>
