<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title></title>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="author" content="Alexander Bulimov">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
      <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->

    <!-- Le styles -->
<link href='/assets/stylesheets/bootstrap.min-88238289010db19359d2181e634e95cd.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/style-e81fa375b231bedf6cb2dbc6653570cc.css' type='text/css' rel='stylesheet' media='all'>
<link href='/assets/stylesheets/google_prettify/sons-of-obsidian-afb0925bfa2d994f17dab93e13fbf999.css' type='text/css' rel='stylesheet' media='all'>
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->
  </head>

  <body>

    <div class="navbar">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Alexander Bulimov&#39;s blog</a>
          <ul class="nav">
              
                <li><a href="/archive">Статьи</a></li>
              
              
                <li><a href="/tags">Теги</a></li>
              
              
                <li><a href="/categories">Категории</a></li>
              
              
                <li><a href="/about">Обо мне</a></li>
              
          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        <div class="row-fluid">
  <div class="span12">
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9E-%D0%B6%D0%B8%D0%B2%D0%BE%D1%82%D0%BD%D1%8B%D1%85-%D0%B8-networkmanager">О животных и NetworkManager</a> <span class="date">2013-10-02</span></h3>

        <div class="summary">
<p>&#1042; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1093; &#1082; <a href="http://www.opennet.ru/opennews/art.shtml?num=38016"> &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1100;&#1102; &#1089; &#1040;&#1083;&#1077;&#1082;&#1089;&#1077;&#1077;&#1084; &#1050;&#1091;&#1079;&#1085;&#1077;&#1094;&#1086;&#1074;&#1099;&#1084; </a>
&#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1083; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1077;:</p>

<blockquote>
<blockquote>
<p>NetworkManager &#1087;&#1083;&#1086;&#1093;&#1086;&#1081;, &#1072; &#1082;&#1072;&#1082;&#1072;&#1103; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1072;?</p>
</blockquote>

<p>ip addr add 12.34.56.78/24 dev eth0
ip ro add default via 12.34.56.1</p>

<p>&#1045;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1091;-&#1090;&#1086; &#1085;&#1091;&#1078;&#1077;&#1085; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1075;&#1091;&#1081; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; - &#1090;&#1086; &#1086;&#1085; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1078;&#1080;&#1074;&#1086;&#1090;&#1085;&#1086;&#1077;&trade;.</p>
</blockquote>
</div>

        <div class="more">
          <a href="/it/%D0%9E-%D0%B6%D0%B8%D0%B2%D0%BE%D1%82%D0%BD%D1%8B%D1%85-%D0%B8-networkmanager" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%92%D0%B5%D1%80%D0%BD%D1%83%D0%BB%D1%81%D1%8F-%D0%B8%D0%B7-%D0%BE%D1%82%D0%BF%D1%83%D1%81%D0%BA%D0%B0">Вернулся из отпуска</a> <span class="date">2013-10-01</span></h3>

        <div class="summary">
<p>&#1042;&#1077;&#1088;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; &#1089; &#1078;&#1077;&#1085;&#1086;&#1081; &#1080;&#1079; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1086;&#1074;&#1077;&#1083;&#1080; &#1074; &#1048;&#1085;&#1076;&#1086;&#1085;&#1077;&#1079;&#1080;&#1080;.
&#1048;&#1079; IT-&#1085;&#1072;&#1073;&#1083;&#1102;&#1076;&#1077;&#1085;&#1080;&#1081;: &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1086;&#1090;&#1077;&#1083;&#1103;&#1093; &#1080; &#1082;&#1072;&#1092;&#1077; &#1085;&#1072; &#1041;&#1072;&#1083;&#1080;, &#1043;&#1080;&#1083;&#1080; &#1080; &#1051;&#1086;&#1084;&#1073;&#1086;&#1082;&#1077;
&#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1083;&#1080;&#1089;&#1100; &#1084;&#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1078;&#1077;&#1083;&#1077;&#1079;&#1082;&#1080; Mikrotik &#1074; &#1088;&#1086;&#1083;&#1080; HotSpot.
&#1047;&#1072;&#1073;&#1072;&#1074;&#1085;&#1086; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; Linux-based &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090; &#1051;&#1072;&#1090;&#1074;&#1080;&#1081;&#1089;&#1082;&#1080;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;
&#1074; &#1076;&#1072;&#1083;&#1077;&#1082;&#1086;&#1081; &#1048;&#1085;&#1076;&#1086;&#1085;&#1077;&#1079;&#1080;&#1080;.
&#1053;&#1072; &#1055;&#1050; &#1089;&#1083;&#1091;&#1078;&#1072;&#1097;&#1080;&#1093; - &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; Windows XP, &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1042;&#1080;&#1089;&#1090; &#1080; &#1057;&#1077;&#1084;&#1077;&#1088;&#1086;&#1082;-&#1074;&#1086;&#1089;&#1100;&#1084;&#1077;&#1088;&#1086;&#1082;.</p>

<p>&#1053;&#1091; &#1080; &#1089;&#1072;&#1084;&#1086;&#1077; &#1091;&#1078;&#1072;&#1089;&#1085;&#1086;&#1077; - &#1072;&#1101;&#1088;&#1086;&#1087;&#1086;&#1088;&#1090; &#1075;&#1086;&#1088;&#1086;&#1076;&#1072; &#1044;&#1077;&#1085;&#1087;&#1072;&#1089;&#1072;&#1088;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072; &#1041;&#1072;&#1083;&#1080; - &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;
&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;. &#1053;&#1072; &#1087;&#1086;&#1089;&#1072;&#1076;&#1086;&#1095;&#1085;&#1099;&#1093; &#1090;&#1072;&#1083;&#1086;&#1085;&#1072;&#1093; &#1085;&#1086;&#1084;&#1077;&#1088; &#1088;&#1077;&#1081;&#1089;&#1072; &#1080; &#1085;&#1086;&#1084;&#1077;&#1088; &#1084;&#1077;&#1089;&#1090;&#1072; &#1087;&#1080;&#1096;&#1091;&#1090; &#1086;&#1090; &#1088;&#1091;&#1082;&#1080;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072;
&#1087;&#1086;&#1089;&#1072;&#1076;&#1082;&#1080; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1083;&#1080;&#1089;&#1090;&#1082;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1080; &#1088;&#1091;&#1095;&#1082;&#1080;.
&#1055;&#1088;&#1072;&#1074;&#1076;&#1072;, &#1088;&#1103;&#1076;&#1086;&#1084; &#1087;&#1086;&#1095;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1083;&#1080; &#1085;&#1086;&#1074;&#1099;&#1081; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;, &#1084;&#1099; &#1090;&#1091;&#1076;&#1072; &#1087;&#1088;&#1086;&#1075;&#1091;&#1083;&#1103;&#1083;&#1080;&#1089;&#1100; - &#1090;&#1072;&#1084; &#1091;&#1078;&#1077; &#1074;&#1089;&#1077; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1080; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;.</p>
</div>

        <div class="more">
          <a href="/it/%D0%92%D0%B5%D1%80%D0%BD%D1%83%D0%BB%D1%81%D1%8F-%D0%B8%D0%B7-%D0%BE%D1%82%D0%BF%D1%83%D1%81%D0%BA%D0%B0" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9A%D0%B0%D0%BA-%D1%8F-%D1%83%D0%BF%D1%80%D0%B0%D0%B2%D0%BB%D1%8F%D1%8E-%D1%81%D0%B5%D1%80%D0%B2%D0%B5%D1%80%D0%B0%D0%BC%D0%B8">Как я управляю серверами</a> <span class="date">2013-09-05</span></h3>

        <div class="summary ellipsis">
<p>&#1056;&#1077;&#1096;&#1080;&#1083; &#1074;&#1086;&#1090; &#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1099; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;&#1084;&#1080;, &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1087;&#1088;&#1080;&#1096;&#1077;&#1083; &#1079;&#1072; &#1101;&#1090;&#1080; 3 &#1075;&#1086;&#1076;&#1072;.</p>

<p>&#1048;&#1090;&#1072;&#1082;:</p>

<h4 id="toc_0">&#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#8470;1</h4>

<p>&#1042;&#1089;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1080; &#1083;&#1077;&#1078;&#1072;&#1090; &#1074; <a href="http://en.wikipedia.org/wiki/Revision_control">VCS</a>, &#1103; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102; Git.
&#1071; &#1076;&#1091;&#1084;&#1072;&#1102;, &#1074; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1093; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1085;&#1077; &#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1086;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1086;&#1090;&#1082;&#1072;&#1090;&#1072; &#1086;&#1073;&#1089;&#1091;&#1078;&#1076;&#1072;&#1083;&#1072;&#1089;&#1100; &#1085;&#1077; &#1088;&#1072;&#1079;.</p>

<h4 id="toc_1">&#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#8470;2</h4>

<p>&#1042;&#1089;&#1077; &#1055;&#1054; &#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1079; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; ./configure &amp;&amp; make &amp;&amp; make install.
&#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1085;&#1077;&#1090; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;&#1093; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072; - &#1080;&#1097;&#1077;&#1084; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090;, &#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1086;&#1090; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1080;&#1083;&#1080; &#1086;&#1090; &#1089;&#1086;&#1083;&#1080;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1075;&#1086; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; &#1090;&#1080;&#1087;&#1072; <a href="http://www.dotdeb.org/">dotdeb</a>. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072; &#1076;&#1083;&#1103; &#1055;&#1054; &#1085;&#1077;&#1090; - &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084; &#1087;&#1072;&#1082;&#1077;&#1090; &#1089;&#1072;&#1084;&#1080;,
&#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1074;&#1089;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1076;&#1083;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080; &#1082;&#1083;&#1072;&#1076;&#1077;&#1090;&#1089;&#1103; &#1074; VCS.
&#1042;&#1089;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1089;&#1074;&#1086;&#1081; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1077;&#1089;&#1090;&#1100; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; stable &#1080; testing.
&#1042;&#1089;&#1077; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1080;&#1079; testing, &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1085;&#1072; &#1089;&#1090;&#1077;&#1081;&#1076;&#1078;&#1080;&#1085;&#1075;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; stable.
&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1084;&#1099; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1055;&#1054; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072;, &#1095;&#1090;&#1086; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1091;&#1087;&#1088;&#1086;&#1097;&#1072;&#1077;&#1090; &#1078;&#1080;&#1079;&#1085;&#1100; &#1089;&#1080;&#1089;&#1072;&#1076;&#1084;&#1080;&#1085;&#1072;.</p>

<p><em>&#1059;&#1078;&#1077; &#1088;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1089;&#1090;&#1074;&#1091;&#1103;&#1089;&#1100; &#1101;&#1090;&#1080;&#1084;&#1080; &#1076;&#1074;&#1091;&#1084;&#1103; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;&#1084;&#1080;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1073;&#1077;&#1079; &#1083;&#1080;&#1096;&#1085;&#1080;&#1093; &#1091;&#1089;&#1080;&#1083;&#1080;&#1081; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1082;&#1086;&#1087;&#1080;&#1102; &#1085;&#1091;&#1078;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103;
(production &#1080;&#1083;&#1080; staging), &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1077;&#1084;&#1086;&#1089;&#1090;&#1100; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1085;&#1072;&#1084; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;.</em></p>
</div>

        <div class="more">
          <a href="/it/%D0%9A%D0%B0%D0%BA-%D1%8F-%D1%83%D0%BF%D1%80%D0%B0%D0%B2%D0%BB%D1%8F%D1%8E-%D1%81%D0%B5%D1%80%D0%B2%D0%B5%D1%80%D0%B0%D0%BC%D0%B8" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9D%D0%B8%D0%B7%D0%BA%D0%BE%D1%83%D1%80%D0%BE%D0%B2%D0%BD%D0%B5%D0%B2%D0%BE%D0%B5-%D0%BE%D0%B1%D0%BD%D0%B0%D1%80%D1%83%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B2-zabbix-%D0%B8%D1%89%D0%B5%D0%BC-%D0%B4%D0%B8%D1%81%D0%BA%D0%B8-%D0%B2-%D0%BA%D0%BE%D0%BD%D1%82%D1%80%D0%BE%D0%BB%D0%BB%D0%B5%D1%80%D0%B5-%D0%BE%D1%82-3ware">Низкоуровневое обнаружение в Zabbix, ищем диски в контроллере от 3ware</a> <span class="date">2013-08-14</span></h3>

        <div class="summary ellipsis">
<p>&#1071; &#1091;&#1078;&#1077; <a href="/it/%D0%9D%D0%B8%D0%B7%D0%BA%D0%BE%D1%83%D1%80%D0%BE%D0%B2%D0%BD%D0%B5%D0%B2%D0%BE%D0%B5-%D0%BE%D0%B1%D0%BD%D0%B0%D1%80%D1%83%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B2-zabbix"> &#1087;&#1080;&#1089;&#1072;&#1083; </a> &#1087;&#1088;&#1086; <a href="https://www.zabbix.com/documentation/ru/2.0/manual/discovery/low_level_discovery">&#1085;&#1080;&#1079;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1086;&#1077; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</a>
&#1074; Zabbix, &#1090;&#1072;&#1082; &#1095;&#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1090;&#1100; &#1090;&#1077;&#1086;&#1088;&#1080;&#1102; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;.</p>

<p>&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1085;&#1077; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1083;&#1086;&#1089;&#1100; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1086;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1093;&#1072;&#1088;&#1076;&#1086;&#1074; &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072;&#1093;
&#1085;&#1072; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088;&#1072;&#1093; 3ware, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1099; &#1091; &#1085;&#1072;&#1089; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.</p>

<p>&#1042;&#1077;&#1089;&#1090;&#1080; &#1088;&#1091;&#1082;&#1072;&#1084;&#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; &#1089; &#1080;&#1085;&#1099;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1084; &#1080;&#1083;&#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;
&#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1083;&#1086;&#1089;&#1100; &#1084;&#1085;&#1077; &#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1080;&#1076;&#1077;&#1077;&#1081;, &#1076;&#1072; &#1080; &#1072;&#1074;&#1090;&#1086;-&#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089;&#1072;&#1084;&#1086; &#1085;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100;.</p>

<p>&#1042;&#1076;&#1086;&#1093;&#1085;&#1086;&#1074;&#1083;&#1103;&#1083;&#1089;&#1103; &#1103; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1086;&#1081; 3ware-status, &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1072;&#1074;&#1090;&#1086;-&#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1072; tw-cli, &#1074;&#1079;&#1103;&#1090;&#1100; &#1077;&#1077; &#1076;&#1083;&#1103; Debian/Ubuntu &#1087;&#1088;&#1086;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; <a href="http://hwraid.le-vert.net/"> &#1079;&#1076;&#1077;&#1089;&#1100; </a>.</p>

<p>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1090;&#1072;&#1082;:</p>

<ol>
<li>&#1055;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1086;&#1073;&#1097;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; <code>tw-cli info</code>, &#1074;&#1099;&#1095;&#1083;&#1077;&#1085;&#1103;&#1077;&#1084; &#1086;&#1090;&#1090;&#1091;&#1076;&#1072; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;
&#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088;&#1086;&#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1085;&#1100;&#1082;&#1086;&#1081; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1082;&#1086;&#1081; <code>^c[0-9]+$</code>
</li>
<li>&#1055;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088;&#1072; <code>tw-cli %controller info</code>, &#1086;&#1087;&#1103;&#1090;&#1100;-&#1090;&#1072;&#1082;&#1080;
&#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1082;&#1086;&#1081; <code>^[p][0-9]+$</code> &#1074;&#1099;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1077;&#1084; &#1086;&#1090;&#1090;&#1091;&#1076;&#1072; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1093;&#1072;&#1088;&#1076;&#1086;&#1074;</li>
<li>&#1054;&#1090;&#1076;&#1072;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; JSON</li>
<li>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;&#1093; &#1079;&#1072;&#1073;&#1073;&#1080;&#1082;&#1089;&#1072;, &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <em>&#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</em>,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1090;&#1072;&#1097;&#1080;&#1090;&#1100; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089;&#1099; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1076;&#1080;&#1089;&#1082;&#1072; &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; 3ware-status &#1080;&#1083;&#1080; tw-cli</li>
</ol>
</div>

        <div class="more">
          <a href="/it/%D0%9D%D0%B8%D0%B7%D0%BA%D0%BE%D1%83%D1%80%D0%BE%D0%B2%D0%BD%D0%B5%D0%B2%D0%BE%D0%B5-%D0%BE%D0%B1%D0%BD%D0%B0%D1%80%D1%83%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B2-zabbix-%D0%B8%D1%89%D0%B5%D0%BC-%D0%B4%D0%B8%D1%81%D0%BA%D0%B8-%D0%B2-%D0%BA%D0%BE%D0%BD%D1%82%D1%80%D0%BE%D0%BB%D0%BB%D0%B5%D1%80%D0%B5-%D0%BE%D1%82-3ware" class="btn btn-small">read more..</a>
        </div>
      </div>
      <div class="posts">
        <h3 class="title"><a href="/it/%D0%9E-%D0%BB%D1%8E%D0%B1%D0%B2%D0%B8-%D0%BA-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8E">О любви к программированию</a> <span class="date">2013-07-25</span></h3>

        <div class="summary ellipsis">
<p>&#1061;&#1086;&#1090;&#1100; &#1103; &#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1083; &#1089;&#1074;&#1086;&#1077;&#1081; &#1087;&#1088;&#1086;&#1092;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1077; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;,
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1103; &#1083;&#1102;&#1073;&#1083;&#1102;. &#1044;&#1072;&#1078;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1083;&#1102;&#1073;&#1083;&#1102;.</p>

<p>&#1042;&#1086;&#1090; &#1088;&#1077;&#1096;&#1080;&#1083; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1102; &#1084;&#1086;&#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1072; &#1089; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;.</p>

<h3 id="toc_0">&#1064;&#1082;&#1086;&#1083;&#1072;</h3>

<p>&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1089;&#1077; &#1074; &#1096;&#1082;&#1086;&#1083;&#1077;. &#1054;&#1076;&#1085;&#1086;&#1082;&#1083;&#1072;&#1089;&#1089;&#1085;&#1080;&#1082; &#1093;&#1086;&#1076;&#1080;&#1083; &#1085;&#1072; &#1082;&#1091;&#1088;&#1089;&#1099; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;,
&#1075;&#1086;&#1090;&#1086;&#1074;&#1103;&#1089;&#1100; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1090;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1091;&#1079;, &#1080; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1083; &#1087;&#1088;&#1086; Delphi.
&#1056;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099; &#1077;&#1075;&#1086; &#1090;&#1072;&#1082; &#1084;&#1077;&#1085;&#1103; &#1091;&#1074;&#1083;&#1077;&#1082;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1103; &#1076;&#1072;&#1078;&#1077; &#1089;&#1087;&#1086;&#1076;&#1086;&#1073;&#1080;&#1083;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1089;&#1072;&#1084;&#1099;&#1081; Delphi,
&#1080; &#1076;&#1072;&#1078;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083; &#1082;&#1072;&#1082;&#1091;&#1102;-&#1090;&#1086; &#1092;&#1086;&#1088;&#1084;&#1091;, &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1074; &#1082;&#1086;&#1076; &#1080;&#1079; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1089;&#1083;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1076;&#1085;&#1086;&#1082;&#1083;&#1072;&#1089;&#1089;&#1085;&#1080;&#1082;&#1086;&#1084;.
&#1055;&#1086; &#1080;&#1090;&#1086;&#1075;&#1091; &#1101;&#1090;&#1080;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;, &#1091; &#1084;&#1077;&#1085;&#1103; &#1089;&#1083;&#1086;&#1078;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074;&#1087;&#1077;&#1095;&#1072;&#1090;&#1083;&#1077;&#1085;&#1080;&#1077;,
&#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; - &#1101;&#1090;&#1086; &#1090;&#1086;&#1095;&#1085;&#1086; &#1085;&#1077; &#1076;&#1083;&#1103; &#1084;&#1077;&#1085;&#1103;. &#1071; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;&#1091;&#1074;&#1077;&#1088;&#1080;&#1083;&#1089;&#1103; &#1074; &#1089;&#1074;&#1086;&#1080;&#1093; &#1089;&#1080;&#1083;&#1072;&#1093;
&#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1086;&#1087;&#1099;&#1090;&#1086;&#1082; &#1088;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074; Delphi, &#1095;&#1090;&#1086; &#1076;&#1086; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074; &#1042;&#1059;&#1047; &#1076;&#1072;&#1078;&#1077;
&#1085;&#1077; &#1087;&#1099;&#1090;&#1072;&#1083;&#1089;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1083;&#1077;&#1079;&#1090;&#1100; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.</p>

<h3 id="toc_1">&#1055;&#1077;&#1088;&#1074;&#1099;&#1081;-&#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1082;&#1091;&#1088;&#1089;&#1099;, Borland Pascal</h3>

<p>&#1042;&#1089;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1086;&#1089;&#1100; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1082;&#1091;&#1088;&#1089;&#1077; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; "&#1055;&#1088;&#1080;&#1082;&#1083;&#1072;&#1076;&#1085;&#1072;&#1103; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1072;", &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1103;
&#1085;&#1072;&#1080;&#1074;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1083; &#1087;&#1088;&#1080; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1080; &#1074; &#1042;&#1059;&#1047;. &#1053;&#1072;&#1089; &#1091;&#1095;&#1080;&#1083;&#1080; &#1072;&#1079;&#1072;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; Turbo Pascal.
&#1050;&#1072;&#1082;-&#1090;&#1086; &#1089;&#1072;&#1084;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1082; &#1082;&#1086;&#1085;&#1094;&#1091; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1082;&#1091;&#1088;&#1089;&#1072; &#1103; &#1076;&#1077;&#1083;&#1072;&#1083; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1099;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1076;&#1088;&#1091;&#1079;&#1100;&#1103;&#1084;
&#1080; &#1086;&#1076;&#1085;&#1086;&#1082;&#1091;&#1088;&#1089;&#1085;&#1080;&#1082;&#1072;&#1084;. &#1053;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1082;&#1091;&#1088;&#1089;&#1077; &#1090;&#1077;&#1085;&#1076;&#1077;&#1085;&#1094;&#1080;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1072;&#1089;&#1100;.</p>
</div>

        <div class="more">
          <a href="/it/%D0%9E-%D0%BB%D1%8E%D0%B1%D0%B2%D0%B8-%D0%BA-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8E" class="btn btn-small">read more..</a>
        </div>
      </div>
    
    <div class="pagination">
      <ul>
          <li><a href="/">1</a></li>
          <li><a href="/posts/index/2">2</a></li>
          <li class="active"><a href="/posts/index/3">3</a></li>
          <li><a href="/posts/index/4">4</a></li>
          <li><a href="/posts/index/5">5</a></li>
      </ul>
    </div>
  </div>
</div>

      </div>

      <hr>
      <div class="footer">
          <p>&copy; <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/"><img alt="Creative Commons License" style="border-width:0" src="http://i.creativecommons.org/l/by-sa/3.0/80x15.png" /></a> Alexander Bulimov
          with help from <a href="http://ruhoh.com" target="_blank" title="The Definitive Technical Blogging Framework">ruhoh</a>
          and <a href="http://twitter.github.com/bootstrap/" target="_blank">Twitter Bootstrap</a>
        </p>
      </div>

    </div> <!-- /container -->

    <!-- Google Prettify -->
<script src="http://cdnjs.cloudflare.com/ajax/libs/prettify/188.0.0/prettify.js"></script>
<script>
  var pres = document.getElementsByTagName("pre");
  for (var i=0; i < pres.length; ++i) {
    pres[i].className = "prettyprint linenums";
  }
  prettyPrint();
</script>
<!-- end Google Prettify -->
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-49230997-1']);
  _gaq.push(['_trackPageview']);
  

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>



  </body>
</html>
